[
   {
      "text": "OP's Bio: I climb from time to time.  I play the clarinet",
      "label": "neutral"
   },
   {
      "text": "I am a chemistry master student If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you think it doesn’t, downvote it",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: 18y/o dual sport college athlet If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide Aint no way you’re 18, stop lying on reddit bruh",
      "label": "neutral"
   },
   {
      "text": "We shouldn't look the same age",
      "label": "neutral"
   },
   {
      "text": "Go to a doctor That just means you can be 18 on Reddit too",
      "label": "neutral"
   },
   {
      "text": "I better use my strong hand. . .",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I am in sales and I try to fit the role as a fat Tony Stark If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "Most people learn by the time they are age 7 to never button up the top button",
      "label": "neutral"
   },
   {
      "text": "I see you've already sold a few of your chromosome I see your tits stil Venmo $5 and I'll show you the nipple Well, how is he supposed to sell without displaying I need to think about i I need to talk to my wife firs Kryptonit",
      "label": "neutral"
   },
   {
      "text": "I can’t even look at your face",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Golfer, favorite movie is dumb and dumber, likes to skip leg day, am a fan of dunking cookies in mil If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "Mingle and be friendly and not so self absorbed",
      "label": "neutral"
   },
   {
      "text": "Good luck my man Seconded",
      "label": "neutral"
   },
   {
      "text": "College is a time to open yourself up and meet people",
      "label": "neutral"
   },
   {
      "text": "Get out of your shell",
      "label": "neutral"
   },
   {
      "text": "Join a club to try new stuff and meet people He needs to get into counselling asap",
      "label": "neutral"
   },
   {
      "text": "Also, he needs to understand that having a gf doesn't automatically make him happy",
      "label": "neutral"
   },
   {
      "text": "That's putting way too much onto the girl",
      "label": "neutral"
   },
   {
      "text": "He won't find a girl until he gets right with himself",
      "label": "neutral"
   },
   {
      "text": "Step away from the pot.  Clear your mind",
      "label": "neutral"
   },
   {
      "text": "Marijuana is a depressant, if you are depressed, which you are, you're making it worse by getting stoned",
      "label": "neutral"
   },
   {
      "text": "Get out into the fresh air,  start hiking or going to the gym",
      "label": "neutral"
   },
   {
      "text": "Join a club, you'll meet new people that way Keep your eyes on this picture… you’re well on your way to a dad bod",
      "label": "neutral"
   },
   {
      "text": "You will grab the spatula, flip over a couple low fat burgers ( gotta watch that cholesterol) And as the burgers settle into their new position, you will say out loud that’s money right there… That’s money right ther This isn’t a roast",
      "label": "neutral"
   },
   {
      "text": "You posted this 6 hours ago and there is one comment, that should be roast enough",
      "label": "neutral"
   },
   {
      "text": "That sound cloud rapper (lil squirt?) in Japan gets more fan fare This should be fun. . . .    Crickets",
      "label": "neutral"
   },
   {
      "text": "G",
      "label": "neutral"
   },
   {
      "text": "o",
      "label": "neutral"
   },
   {
      "text": "e",
      "label": "neutral"
   },
   {
      "text": "Take my lik How many cool fedora tricks do you know Steve Jobles Usually guys wearing a class ring peaked in high school",
      "label": "neutral"
   },
   {
      "text": "Nice on Newfie, Drunk, story checks out When they give you hat for spending the most money at the local pub",
      "label": "neutral"
   },
   {
      "text": "via GIPHY Way too accurate🤣 Came here to post a dumbo gif, saw this and its way bette I am not scrolling for more comments",
      "label": "neutral"
   },
   {
      "text": "I am done here Om He is a son of creator of that movi Get a couple rats and we got the entire ratatouille movie, right here You look like a poorly designed and badly written Pixar character do your worst looks like your barber beat us to tha life basically beat us to i I know this is a roast but I like his hair I’d recommend some more length though to cover the ears You look like a rat who left his chef job to become a real bo With those ears we don't need satalite dishes anymore Is that what you said to your barber You look like a young David Faustino fucked Mickey Mouse Italian mechanist? Thats to easy, grab some Mushrooms and go safe the princes Declan Rice's son if he had sex with a giant mous Do your worst Looks like God already di I bet the only head you get is bed head That phone really does take good pictures! Too bad you are in this one.",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Hobbies= Reading, Writing, Video Games, &amp; Music.  Favorite Sport = Basketball",
      "label": "neutral"
   },
   {
      "text": "Favorite Movie = U If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If the roastee is indeed over 18, please contact us over modmail WITH PROOF We will reverse our ruling and allow you to repost after seeing photo ID including picture and date of birt",
      "label": "neutral"
   },
   {
      "text": "All other information can be censored at your own discretion, and we will not use anything sent to us for anything more than verifying the roastee's age",
      "label": "neutral"
   },
   {
      "text": "Please DO NOT upload a photograph of your ID to your Reddit account - use imgur or another image hosting platform and send us a link to the photo via modmail Click here to send us a message If you feel that it has been removed in error, please message u so that we may review it You uploaded it five hours ago and still you have only three roasts (including mine)",
      "label": "neutral"
   },
   {
      "text": "I had a good one",
      "label": "neutral"
   },
   {
      "text": "You should immediately transfer to a different skool",
      "label": "neutral"
   },
   {
      "text": "Go easy, he probably dropped out 20 years ago What school do you go to? You should request a refund",
      "label": "neutral"
   },
   {
      "text": "Its a multi Tasker, I'll give it that. . .",
      "label": "neutral"
   },
   {
      "text": "a bit like mayo? ;",
      "label": "neutral"
   },
   {
      "text": "Imagine the snot Everyone nose that's not possibl",
      "label": "neutral"
   },
   {
      "text": "How much you want to bet I could throw this football over them mountains?",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I have a Dead Space/xenomorph tattoo sleeve, I play too many video games, and think pie is better than cake",
      "label": "neutral"
   },
   {
      "text": "Fight me on it If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "I’m just so Goth and quirky",
      "label": "neutral"
   },
   {
      "text": "I play video games Blablablabla",
      "label": "neutral"
   },
   {
      "text": "uk/news/world-us-canada-6381716 via GIPH Take my upvote and begon Aint no way you’re 18, stop lying on reddit bruh",
      "label": "neutral"
   },
   {
      "text": "Graduate and make yourself useful - keep the Interwebs running smoothly Isolation. . restraining order.",
      "label": "neutral"
   },
   {
      "text": "it’s all the same, right",
      "label": "neutral"
   },
   {
      "text": "But good luck man I hope you get a new place and life works out It looks like brushing your teeth is the only form of personal hygiene you practice Have you asked your parents to help with your vape shop project yet You look like someone snaked you out of a fucking drain Congrats",
      "label": "neutral"
   },
   {
      "text": "But getting out on parole isnt really the same with divorce",
      "label": "neutral"
   },
   {
      "text": "They don’t want any part of you back",
      "label": "neutral"
   },
   {
      "text": "This is gold A LOT older.  Like nursing home older",
      "label": "neutral"
   },
   {
      "text": "nota roast but are you and u/ Finest_Hou friends? same bathroom is tripping me ou Friends and neighbors irl",
      "label": "neutral"
   },
   {
      "text": "It takes literally less than 2 minutes to clean your mirror",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I make cement, enjoy video games and hanging friend If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide You look like Snow White took off her makeup and went into anaphylactic shock He looks like a very aggressive lesbia Meth Roge Lmao",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: 4’11 75 lbs",
      "label": "neutral"
   },
   {
      "text": "I’m an easy target so I’ve heard it all",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Currently battling an eating disorde If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "hands down You look like you ate the old yo Life's hard for you? I am not",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I work at a school in the cafeteria for a few hours everyday, Im a gamer, constantly gaming on my free time",
      "label": "neutral"
   },
   {
      "text": "I'm depressed on and off but mainly fine, nothing serious",
      "label": "neutral"
   },
   {
      "text": "Finally since I'm a gamer, I Livestream and do YouTube",
      "label": "neutral"
   },
   {
      "text": "I try to make others happy If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "I refuse to roast the mentally disabled",
      "label": "neutral"
   },
   {
      "text": "Dont give him a knife",
      "label": "neutral"
   },
   {
      "text": "He is definately a special person",
      "label": "neutral"
   },
   {
      "text": "He won't look handsome, but it'll be an improvement And I thought my smile was bad Why you smile like that? You like the chucks doll with the stretch face in curse of chuck via GIPH You look like the reason the Cleveland Indians changed their name Really asian community can cancel you for that kind of face Is he made of playdo I could draw musical notation onto that forehead That’s the face of someone who has the perfect grip and plenty of lotio You look like luigi with autis You have your own wing of the friend zone",
      "label": "neutral"
   },
   {
      "text": "Being a foot taller doesn't count as a long distance relationship",
      "label": "neutral"
   },
   {
      "text": "make me cry' - i thought he is already crying on that photo Nice try",
      "label": "neutral"
   },
   {
      "text": "I still miss my ex who left me If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I'm  24 I Live with my parents and I Own a Ba If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "From the looks of it, a lot Your beard is just ok",
      "label": "neutral"
   },
   {
      "text": "If I’m in my mid 40s still living with my mother because I’m trying to figure out my life was a picture '. .",
      "label": "neutral"
   },
   {
      "text": "now can i get your credit card number please",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: i like to play cricket. .",
      "label": "neutral"
   },
   {
      "text": "favourite movies consider infinity war, taxi driver, 3 idiots etc i dont have any strict political views, recently faced a rejection, so kinda recovering from that.",
      "label": "neutral"
   },
   {
      "text": "If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Cosplay as spider man",
      "label": "neutral"
   },
   {
      "text": "Alternative universe Bad bunny is my fashion ido If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Hobbies: baking, food, travel, lifting",
      "label": "neutral"
   },
   {
      "text": "Busy with work and my hubby and our dogs, and avoiding cardio If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I love playing dnd Reading hitchikers guide to galaxy, i am leftist as fuck punk guy",
      "label": "neutral"
   },
   {
      "text": "Studing pedagogy, autistic retard loving Animals",
      "label": "neutral"
   },
   {
      "text": "I am always happy and positive, the wirst thing that happen to me is that my crash came out as a lesbian, third girl in a row. .",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide Give me your worst",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Im a prescription drug addict",
      "label": "neutral"
   },
   {
      "text": "I love horror movies and heavy metal",
      "label": "neutral"
   },
   {
      "text": "Im a lazy asshole that mever does anything on time",
      "label": "neutral"
   },
   {
      "text": "That is all you need to know about me",
      "label": "neutral"
   },
   {
      "text": "And oh yeah im severely mentally ill amd im staying at a psych ward on monday and im staying for a week If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "you have the right amount of self esteem for someone who looks like you",
      "label": "neutral"
   },
   {
      "text": "always seeing someone on the side She had told me she left me for this dude by name of tannen, what a mad dog.",
      "label": "neutral"
   },
   {
      "text": "I have owned pet lizards with less eye drift No fear for freedom. .",
      "label": "neutral"
   },
   {
      "text": "ashamed for all those lizards Huh. . .",
      "label": "neutral"
   },
   {
      "text": "What does it say on the reverse side? Come and get it boys Because only kings lead, romeo &amp; julio",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I’ve been depressed for 10+ years and my body is starting to give out.  Serious drinking problem",
      "label": "neutral"
   },
   {
      "text": "I usually take whatever drug is available If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide Django Unfuckabl The D is dry, hillbilly Me: Mom can we listen to Drake Mom:  We have Drake at home Drake at home He looks like if Drake's Honestly Nevermind album was an actual perso lol okay this one is pretty good Winner Looks more like WAK Prescot Ahhhhh!!!! Lmfaoo Gold Wasn’t he on Duhgrassi Jeez even your eyes refuse to be close to each othe That’s                               Hars I'd give u an award if I wasn't poo Wan anda Foreve Wank hand I went surfing on your forehead wrinkle Kawabung",
      "label": "neutral"
   },
   {
      "text": "Thanks While you may not look as bad as you used to 2 years ago, you defintly look a lot worse than the last pic you posted",
      "label": "neutral"
   },
   {
      "text": "I deleted mine and upvoted yours",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Rancher, college student, incredibly low self esteem but I bet you can make it worse",
      "label": "neutral"
   },
   {
      "text": "Horse girl ri If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide Youre def the face of FarmersOnly. co You mean Incestry. co CousinsOnly",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I’m a 19 yo college student",
      "label": "neutral"
   },
   {
      "text": "I took a gap year to get some work experience",
      "label": "neutral"
   },
   {
      "text": "My hobbies are ultimate frisbee, skiing, and skating, or anything outdoors",
      "label": "neutral"
   },
   {
      "text": "Not to brag or anything, but I was the second best hacky sacker at my highschool",
      "label": "neutral"
   },
   {
      "text": "I listen to music a lot but my favorite artists are Blink-182 and Jack Johnson",
      "label": "neutral"
   },
   {
      "text": "A hot take I have is that drinking is often too expensive for what it’s worth",
      "label": "neutral"
   },
   {
      "text": "However, I am a hydro homie If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "If you’re not sure, leave it to others to decide JFC do you have permanent pink eye? This is the picture you went with His sugar daddy pays him to shit on his face though.",
      "label": "neutral"
   },
   {
      "text": "Makes sense you want to be a carpenter",
      "label": "neutral"
   },
   {
      "text": "mods debating whether special needs should be allowed The worst Roastme I ever saw was 2-3 replies on a 12 hour post",
      "label": "neutral"
   },
   {
      "text": "And it was some girl trying to get Onlyfans signups",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Been stuck at home lately",
      "label": "neutral"
   },
   {
      "text": "can’t wait to start getting more If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Just turned 28, working as a head chef in split shifts 6 days a week in a new country that I don’t speak the language of, single and away from all my friends and family so I can drive a red BMW 2series coupe and feed my tech/gadget addiction If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "2 rods in my spine causing perpetual pain. .",
      "label": "neutral"
   },
   {
      "text": "I mean they appear to be intact, wherever they are. . .",
      "label": "neutral"
   },
   {
      "text": "via GIPH Damn i just saw this after I posted the same shit hah",
      "label": "neutral"
   },
   {
      "text": "That fishhook in your lip clearly shows that someone caught you and threw you back in",
      "label": "neutral"
   },
   {
      "text": "Congrats take my up doo My Little Pony. .",
      "label": "neutral"
   },
   {
      "text": "8 Have you tried littlepeople",
      "label": "neutral"
   },
   {
      "text": "But you know what they say: Find a job you love and you’ll never work a day in your life",
      "label": "neutral"
   },
   {
      "text": "via GIPHY I was gonna say, not sure how no one else saw this right away Savage",
      "label": "neutral"
   },
   {
      "text": "Put the peanut butter away",
      "label": "neutral"
   },
   {
      "text": "I've never seen someone so ambiguous before",
      "label": "neutral"
   },
   {
      "text": "Excellent use of critical thinking, Sparky",
      "label": "neutral"
   },
   {
      "text": "E Actually laughed out loud at this one",
      "label": "neutral"
   },
   {
      "text": "but it also looks like. .",
      "label": "neutral"
   },
   {
      "text": "Detective: Enough with the medical jargon. .",
      "label": "neutral"
   },
   {
      "text": "just give it to me straight",
      "label": "neutral"
   },
   {
      "text": "You are right about him",
      "label": "neutral"
   },
   {
      "text": "My humor is broken and I'm really tired Nice sign",
      "label": "neutral"
   },
   {
      "text": "I didn't know the Confederacy had an IT guy",
      "label": "neutral"
   },
   {
      "text": "Those hypocrites kicked me out",
      "label": "neutral"
   },
   {
      "text": "Having a trust fund isn't something to brag about",
      "label": "neutral"
   },
   {
      "text": "And don't lie to us, you're doing this because you hate yourself, I can smell it through my screen . _3K2ydhts9_ES4s9UpcXqBi{display:block;padding:0 16px;width:100%}",
      "label": "neutral"
   },
   {
      "text": "Cause he thinks that what love is",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Hobbies: Video games, reading, binging shows, DND Favorite movies: Alita battle angel, ready player one, the fast and furious franchise I am 6' 4 and I broke my wrist playing basketball when I tripped over two kids that were shorter than me",
      "label": "neutral"
   },
   {
      "text": "Diagnosed with depression and adhd",
      "label": "neutral"
   },
   {
      "text": "Screw it: my yt with 24 subscribers https://youtube",
      "label": "neutral"
   },
   {
      "text": "com/channel/UCFlgy-4RVU3cmqDV1xfN2H If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "damn I was 4 minutes too late Idk why anyone else is even trying",
      "label": "neutral"
   },
   {
      "text": "Wow, CGI is getting crazy real",
      "label": "neutral"
   },
   {
      "text": "2005 called, it said wt Bro that was my first thought",
      "label": "neutral"
   },
   {
      "text": "Do people still dress like that . _3K2ydhts9_ES4s9UpcXqBi{display:block;padding:0 16px;width:100%}",
      "label": "neutral"
   },
   {
      "text": "I wanna make fun of you but you look like you'd enjoy it. .",
      "label": "neutral"
   },
   {
      "text": "then they get smoked by some 7",
      "label": "neutral"
   },
   {
      "text": "62 in the brai Nah",
      "label": "neutral"
   },
   {
      "text": "change life brosk I really hope to see more of you in this su Text to long br",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: 18 year old adhd college student, liberal, trying his best to keep his grades u If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "He wants to know if you want to have a drink with him Sure man send me his number and we can get a couple cold ones",
      "label": "neutral"
   },
   {
      "text": "I went fully bald for my mom haha",
      "label": "neutral"
   },
   {
      "text": "I’m growing it out now since she passed",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: Hi! This is my bad bio, well I like to play soccer, swim and hike a lot",
      "label": "neutral"
   },
   {
      "text": "Curious on what y’all have to say",
      "label": "neutral"
   },
   {
      "text": "Lol these replies are funn If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "Let’s try this again I might be manic but who knows",
      "label": "neutral"
   },
   {
      "text": "My last streams will come soon on r/distantsocializin If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "OP's Bio: I play a whole lot of video games as you can probably tell, I like metal as you could also tell",
      "label": "neutral"
   },
   {
      "text": "I’m very bland other than that",
      "label": "neutral"
   },
   {
      "text": "I torture myself on souls games and that’s probably why I’m doing this lo If you think this bio helped you roast, upvote this comment",
      "label": "neutral"
   },
   {
      "text": "Sorry to hear that your sister moved on",
      "label": "neutral"
   },
   {
      "text": "with his da How many moths her transition during Damn bro 😂 DUDE dont worry mate there are plenty of dicks in the se It'll be OK",
      "label": "neutral"
   },
   {
      "text": "That was a regular gummy bear",
      "label": "neutral"
   },
   {
      "text": "Oh, wait, that's a mentally disabled learning facility.  Sorry",
      "label": "neutral"
   },
   {
      "text": "via GIPHY Apologies for making the same reference right after you",
      "label": "neutral"
   },
   {
      "text": "I didn’t even read the comments before I posted",
      "label": "neutral"
   },
   {
      "text": "Cocaine hides when you walk by Do not want to roast you.  You are pretty",
      "label": "neutral"
   },
   {
      "text": "Do not even need a makeup",
      "label": "neutral"
   },
   {
      "text": "Just need some plastic surgery",
      "label": "neutral"
   },
   {
      "text": "The problem is, this is simply not true",
      "label": "neutral"
   },
   {
      "text": "Others will follow if necessary",
      "label": "neutral"
   },
   {
      "text": "It’s a fairly straightforward story, but there exists a serious contradiction",
      "label": "neutral"
   },
   {
      "text": "They are wildly different, which obviously doesn’t bode well",
      "label": "neutral"
   },
   {
      "text": "And on and on and on",
      "label": "neutral"
   },
   {
      "text": "It repeatedly makes claims that are simply not true",
      "label": "neutral"
   },
   {
      "text": "There are still more, and I wouldn’t just unload them all on the first post",
      "label": "neutral"
   },
   {
      "text": "This  is not a debate thread",
      "label": "neutral"
   },
   {
      "text": "You can discuss answers or questions but debate  is not the goal",
      "label": "neutral"
   },
   {
      "text": "Ask a question, get an answer, and discuss that  answer",
      "label": "neutral"
   },
   {
      "text": "That is all The goal is to increase our collective knowledge and help those seeking answers but not debate",
      "label": "neutral"
   },
   {
      "text": "If you want to debate; Start a new thread The subreddit rules are still in effect This thread is posted every Wednesday",
      "label": "neutral"
   },
   {
      "text": "You may also be interested in our weekl Meta-Threa (posted every Monday) General Discussio thread (posted every Friday) Simple Questions",
      "label": "neutral"
   },
   {
      "text": "Obviously, such behavior is deceptive and unethical It's also extremely brittle",
      "label": "neutral"
   },
   {
      "text": "This is not an attack or an insult",
      "label": "neutral"
   },
   {
      "text": "This is a fact one can google",
      "label": "neutral"
   },
   {
      "text": "our universe, potentially multiverses and whatnot) If A is contingent, then A ∈ A -----(since A would contain anything contingent, including itself) If ∈ , then is contingent on ------(the same way an atom is contingent on its subatomic constituents) We can chain the relation A ∈ A to get an infinite descending sequence: . .",
      "label": "neutral"
   },
   {
      "text": "∈ A ∈ A ∈ A Parsing the infinite sequence of (4) in the language of (3) gives: A is contingent on A, which is contingent on A, which is again contingent on A, . .",
      "label": "neutral"
   },
   {
      "text": "ad infinitum This is an infinite regress of contingency hence absurd Since A being contingent leads to absurdity, A must be non-contingent Recall that A is tentatively the set that would contain our universe (and potentially other universes etc)",
      "label": "neutral"
   },
   {
      "text": "Just like how universe is the label given to spacetime, matter, energy, quantum fields, etc etc",
      "label": "neutral"
   },
   {
      "text": "This presents a problem, as Dr",
      "label": "neutral"
   },
   {
      "text": "Angus Menuge puts it; before we can talk of being responsible for our decisions, we need an account of why those decisions belong to us",
      "label": "neutral"
   },
   {
      "text": "But the trouble is, on a naturalistic view, there is no entity that can plausibly own any mental states, there is simply a plurality of parallel, impersonal processes in the brain",
      "label": "neutral"
   },
   {
      "text": "• Purpose: the fact that we feel in us an intrinsic purpose contradicts the nihilism inherent in naturalism • Reason (math, science, etc",
      "label": "neutral"
   },
   {
      "text": "): reason requires the existence of immaterial things, as C.  S",
      "label": "neutral"
   },
   {
      "text": "Lewis puts it: If minds are wholly dependent on brains, and brains on biochemistry, and biochemistry (in the long run) on the meaningless flux of the atoms, I cannot understand how the thought of those minds should have any more significance than the sound of the wind in the trees",
      "label": "neutral"
   },
   {
      "text": "• Objective moral facts: what justification is there that obviously bad things are bad? As Stuart Goetz and Charles Taliafero put it, it is not clear how one can establish normative values on the basis of processes that are ultimately thoroughly unconscious, nonnormative, and contingent in nature",
      "label": "neutral"
   },
   {
      "text": "The idea of voluntary necessity is that an action is a necessity because it is predestined to occur, but it is also voluntarily done by the human being who does the action because they undertook the action without coercion",
      "label": "neutral"
   },
   {
      "text": "[Free Will]",
      "label": "neutral"
   },
   {
      "text": "I'd love to know what this common phrase actually mean I've been inspired by several different events/situations/people in my life to then produce some artistic representation, be it a song, a poem, a photograph, a picture, a machinima, whatever",
      "label": "neutral"
   },
   {
      "text": "(all, I have to say, to a very amateur standard!), but the outcome of each of them was produced from my own mind and my own highly personal and subjective interpretation One of the things we love about all forms of art including literature, is the subjective and personal spin on common human feelings, emotions and experiences When claims are made the bible is divinely inspired, does this mean what I have described above? Or is god inspiring to a point he is actually making sure that what is written is what he wante written Does it just mean the writer was inspired by the ide of god, or inspired by previous writers Did god actually send an angel to tell Abraham to go and slaughter his son or did he whisper into someone's ear to write a story about it, or was the writer 'inspired' by the idea of a deity doing something along those lines To claim that an understanding was inspired by god, implies that this understanding is correct, without any discussion of how this took place, what personal spin was put on the inspiration by the writer, it comes across as 'have your cake and eat it' writ large, any errors or sections that (a few thousand years later) are shown to be unpalatable to us are written off as 'yeah, human error, god only inspire it, he didn't write it, but the rest is true, trust me bro' If 'inspiring' is the process by which the bible was written, it is wors than letting us just figure shit out for ourselves",
      "label": "neutral"
   },
   {
      "text": "It places stamp of authority and veracity over works that have been tainted by highly personal subjectivity, published work where the editor, the publisher, the proof-reader and the procurer wash their hands of all responsibility of error, fully happy to claim ownership of anything within that meets approval, and anything else becomes 'nuffin to do wiv me guv' Divine inspiration is terrible process to publish ideas that are important to humanity Divine inspiration is a terrible process to publish ideas that are important to humanity",
      "label": "neutral"
   },
   {
      "text": "and if there is only one daughter, then she shall have half the inheritance",
      "label": "neutral"
   },
   {
      "text": "[Qura 4:1 And the share of the parents is 1/6 + 1/6 = 1/3 of the estate, based on the verse: . .",
      "label": "neutral"
   },
   {
      "text": "96 … In other words, if the deceased left behind 1000 USD, the qaadi (judge) would need only 960 USD to distribute to them according to the Qur’an",
      "label": "neutral"
   },
   {
      "text": "And 40 USD are still left behind",
      "label": "neutral"
   },
   {
      "text": "Let us first present some examples, and your human intellect will automatically guide you that these inheritance laws are unjust and devoid of any wisdom There are many online Islamic Inheritance Calculators present online",
      "label": "neutral"
   },
   {
      "text": "For example Calculator Calculator Please use any online calculator to verify the following examples",
      "label": "neutral"
   },
   {
      "text": "But when she is old and becomes a widow, then she will get only 25% of inheritance",
      "label": "neutral"
   },
   {
      "text": "While the 75% inheritance goes to any distant male relative, like cousin (or any of his descendent), whom the deceased person might not have seen in his entire life",
      "label": "neutral"
   },
   {
      "text": "if a woman dies then the Husband will inherit all her property, despite the presence of her distant relatives",
      "label": "neutral"
   },
   {
      "text": "2nd Example: Mother will get 33",
      "label": "neutral"
   },
   {
      "text": "33%, while distant relatives (like cousins, or his son, or his grandson) will get 66",
      "label": "neutral"
   },
   {
      "text": "67 Similarly, if a deceased person has only an old mother and a distant male relative, then they will get their share as under Relativ Share Fractio Share Percentag Mothe 1/ 33",
      "label": "neutral"
   },
   {
      "text": "33 Any distant Male relative (like cousin or even his descendents 2/ 66",
      "label": "neutral"
   },
   {
      "text": "67 So, the old mother will get only 33",
      "label": "neutral"
   },
   {
      "text": "33%, while a cousin (or his descendents, whom the deceased person might not have seen in his entire life) will get 66",
      "label": "neutral"
   },
   {
      "text": "67% Why Do you see any divine WISDOM here 3rd Example: Sister will get much more share in inheritance than the mother and the wif Even if the sister is married, still she will get more share in inheritance than mother",
      "label": "neutral"
   },
   {
      "text": "Relativ Share Fractio Share Percentag Mothe 2/ 40 Siste 3/ 60 Mother is more closely related to her son, then brother/sister relationship",
      "label": "neutral"
   },
   {
      "text": "Moreover, a widow will get even less than the mother, and the sister's share will become even bigger",
      "label": "neutral"
   },
   {
      "text": "Relativ Share Fractio Share Percentag Wif 1/ 25 Siste 3/ 75 Moreover, even if a deceased person has a daughter, still half of the property will go to the sister (even if she is married)",
      "label": "neutral"
   },
   {
      "text": "Relativ Share Fractio Share Percentag Daughte 1/ 50 Any distant Male relative (like cousin or even his descendents 1/ 50 All these unjust and ridiculous shares are a product of illogical Islamic laws of inheritance, which are devoid of any divine wisdom",
      "label": "neutral"
   },
   {
      "text": "They came up with another self-fabricated solution lin )",
      "label": "neutral"
   },
   {
      "text": "We are born with blank mind so it’s up to our parents to teach us right from wrong, but the thing is all of our parents have sinned, which means they never truly knew right from wrong, and they passed their flawed teaching to us which obviously made us all sin in return! How can prove this? I’ve sinned but don’t remember committing my first sin, nor do remember it being sin, therefore i’m being judged for something wasn’t even aware of which sucks extraordinarily! The point is god gave us two sinners for parents to teach us right from wrong and will judge us accordingly, that make no sense! Jesus’s parents were wise and firm and he turned out sinless and perfect yet get trailer park redneck mom who is an alcoholic that hooks up for fix and beat her childrens and gotta try to find the lord all while fight her drug addict lover and try to save my siblings from being murdered, at this point realized why millions of people suicide, not everyone is fit to live yet are forced to live by god for his glory which left me amazed considering he is just random cosmic entity that we’ve never even met! Anyway what do yall think? god gave us sinner parents",
      "label": "neutral"
   },
   {
      "text": "If we critically examine our givens -- the pieces of information we are taking for granted or assuming a prior -- we will find that a lot of the arguments about religion are based on assumptions that are unsound",
      "label": "neutral"
   },
   {
      "text": "The idea that something simply exists is intuitively offensive to mankind",
      "label": "neutral"
   },
   {
      "text": "The lack of an explanation is an assault on the senses, and our pattern recognition immediately seeks one",
      "label": "neutral"
   },
   {
      "text": "The mysterious, reverent, and all-powerful nature of such a thing is easier to accept in the circumstances, however, to accept it is to not critical examine our givens We must accept that something simply exists",
      "label": "neutral"
   },
   {
      "text": "How we extrapolate this fact is extremely perilous",
      "label": "neutral"
   },
   {
      "text": "It could be said, for example, that an atom depends on protons, neutrons, and electrons to exist, and in that way it is contingent",
      "label": "neutral"
   },
   {
      "text": "There are other renditions, but they fail to withstand scrutiny",
      "label": "neutral"
   },
   {
      "text": "We have gone from composed of other things vs not composed of other things to unchangeable/immoveable vs changeable/movable",
      "label": "neutral"
   },
   {
      "text": "This does not withstand scrutiny, as there is no basis for supposing that non-compositional objects must also be immoveable",
      "label": "neutral"
   },
   {
      "text": "Remember that we are scrutinizing our givens",
      "label": "neutral"
   },
   {
      "text": "Why do we assume that the brute fact of existence constitutes an immoveable/unchangeable object? After all, location and existence are not identical concepts, and it cannot be said that a particle stops existing once it moves elsewhere First Caus The above argument flows quite neatly into the first cause argument, which supposes that the causal chain of reality must hit a stopping point, which is therefore God",
      "label": "neutral"
   },
   {
      "text": "This approach also fails to critical examine one's givens For an object to exist, it must have properties",
      "label": "neutral"
   },
   {
      "text": "We know that there is something rather than nothing",
      "label": "neutral"
   },
   {
      "text": "Again, we must scrutinize our assumptions",
      "label": "neutral"
   },
   {
      "text": "We do not know if there was an initial state of existence or if the universe is infinite",
      "label": "neutral"
   },
   {
      "text": "However, this presupposes that there cannot be other forms of life which would've arisen in these other conditions",
      "label": "neutral"
   },
   {
      "text": "This argument merely represents our inability to know what we don't know",
      "label": "neutral"
   },
   {
      "text": "Rather, it sees this as an aberration subject to treatment, however intractable exclusive homosexuality may now seem to be",
      "label": "neutral"
   },
   {
      "text": "To the question of alteration of homosexual bents, much study must be given, and doubtless in the future clear principles of prevention and treatment will emerge",
      "label": "neutral"
   },
   {
      "text": "Here they explicitly say that it is an aberration which must be treated and authoritatively pronounce that homosexuality does not have a natural cause",
      "label": "neutral"
   },
   {
      "text": "The 1987 quote clearly states that homosexuality is an aberration which is to be treated, then makes a distinction between homosexuality and homosexual acts in order to state that while homosexuality can not currently be treated abstaining from homosexual acts is the only course of action to be taken",
      "label": "neutral"
   },
   {
      "text": "However, this does not by any means imply that the country itself may not, by constitutional means, decide to adopt Bahá’í laws and practices and modify its constitution or method of government accordingly",
      "label": "neutral"
   },
   {
      "text": "This is a positive in regards to rights of women and resolving racial prejudice, but I believe I have demonstrated above that due to the UHJ’s official philosophy this scenario would also lead to state sponsored conversion therapy being imposed Now the one objection which could hold water is that one could argue that while the UHJ condemns homosexuality as an aberration which must be suppressed temporarily until methods of eradicating it are developed, this could be classified as advice rather than a law",
      "label": "neutral"
   },
   {
      "text": "If after a period of probation you do not see an improvement, he should have his voting rights taken away",
      "label": "neutral"
   },
   {
      "text": "It should be used only when there seems no other way to solve the problem.  https://bahai",
      "label": "neutral"
   },
   {
      "text": "Maybe deal with that instead of, like, showing up with armed thugs to threaten people for imaginary reasons at the school board meeting or the library during story time, if preventing actual abuse is indeed something that is of concern to you More double standards between religions and the LGBTQ+ community",
      "label": "neutral"
   },
   {
      "text": "No more so than my keys not being here proves they were taken by key gnomes",
      "label": "neutral"
   },
   {
      "text": "To instantiate them outside of fiction, there has to be evidence",
      "label": "neutral"
   },
   {
      "text": "But my fictional thing solves a real world unknown isn't evidence",
      "label": "neutral"
   },
   {
      "text": "One recommendation from the mod summit was that we have our weekly posts actively encourage discussion that isn't centred around the content of the subreddit",
      "label": "neutral"
   },
   {
      "text": "If you are interested in discussing/debating in real time, check out the related Discord servers in the sidebar This is not a debate thread",
      "label": "neutral"
   },
   {
      "text": "You can discuss things but debate is not the goal The subreddit rules are still in effect This thread is posted every Friday",
      "label": "neutral"
   },
   {
      "text": "You may also be interested in our weekl Meta-Threa (posted every Monday) Simple Question thread (posted every Wednesday) General Discussion 11/25",
      "label": "neutral"
   },
   {
      "text": "What I am proposing is quite simple",
      "label": "neutral"
   },
   {
      "text": "They ALL cannot be correct",
      "label": "neutral"
   },
   {
      "text": "Evidence is required Science has given us theories about the origin of our universe that we can debate over forever Why isn't the default position for every person simply, I don't know",
      "label": "neutral"
   },
   {
      "text": "We don't know how or why the universe came about",
      "label": "neutral"
   },
   {
      "text": "In fact, there are so many unknowns that anyone taking any one single position seems unreasonable",
      "label": "neutral"
   },
   {
      "text": "Hey guys, This might be a controversial topic",
      "label": "neutral"
   },
   {
      "text": "However, after studying Spanish, Portuguese, French and Dutch Colonialism, I came to see that there Colonialism was different",
      "label": "neutral"
   },
   {
      "text": "And let's not get started with America",
      "label": "neutral"
   },
   {
      "text": "But it seems America unlike Dutch started to implement laws against race mixing",
      "label": "neutral"
   },
   {
      "text": "He has a strong- maybe total- amount of influence over what we chose",
      "label": "neutral"
   },
   {
      "text": "Now, maybe you're a compatiablist and think that doesn't affect free will",
      "label": "neutral"
   },
   {
      "text": "It all acted under his orders, in a system he designed, so he holds the blame for the actions of those actors (who, again, are still morally culpable for their part)",
      "label": "neutral"
   },
   {
      "text": "But of course, we're not claiming to be all good",
      "label": "neutral"
   },
   {
      "text": "Let us suppose I see a child being beaten to death",
      "label": "neutral"
   },
   {
      "text": "AI was advanced enough we could make robots that were as capable of feeling fear and pain as humans",
      "label": "neutral"
   },
   {
      "text": "Would it be moral to make the bomb disposal robot sapient Well- no, right? You're creating a mind purely to put it in continuous situations of mortal terror",
      "label": "neutral"
   },
   {
      "text": " To give a being a genuine mind rather then a robotic algorithm in a situation where a sapient mind would be undergoing extreme distress is wrong",
      "label": "neutral"
   },
   {
      "text": " You can come up with other examples- Sapient video game enemies, say, or the aforementioned sapient crash test dummies",
      "label": "neutral"
   },
   {
      "text": " Even if possible, there are situations where its unethical to create a sapient free willed being over a mindless automaton Is existence one of those cases Well- lots of it are",
      "label": "neutral"
   },
   {
      "text": " Surely, the same standard by which the sapient crash test dummy is monstrous applies here- for such people, you should create a robot",
      "label": "neutral"
   },
   {
      "text": " Creating a mind directly into a situation where it will experience extreme suffering is wrong- it is more ethical to make a mindless robot If nothing else, it seems there is no reason for anima life to be more then automata in a world so allegedly anthropocentric",
      "label": "neutral"
   },
   {
      "text": " Yet, as far as we can tell animals have fully functional minds But in this case, free will is not a counter to the problem of suffering",
      "label": "neutral"
   },
   {
      "text": " Insisting that evidence of an unsupported claim is possible/might exist/could be out there is not interchangeable with actual evidence",
      "label": "neutral"
   },
   {
      "text": " I have noticed this trend in discussions here where, when confronted to supply evidence, debates turn towards, Well there COULD be evidence.  Sure.  That's great",
      "label": "neutral"
   },
   {
      "text": " I have no argument with the statement save that it's incomplete What it SHOULD mean is There could be evidence but without that evidence this claim is HIGHLY unlikely to be true / as good as false Too often what it's implied to mean is, There could be evidence and that should give some credence to this claim",
      "label": "neutral"
   },
   {
      "text": " It's a sort of scam; a way to try to make evidence be interchangeable with possible evidence This is not how reality works I can draw a square circle does not become any less false if I word it, There could be evidence I can draw a square circle",
      "label": "neutral"
   },
   {
      "text": " If I say, You (complete stranger reading this reddit post) owe me $50",
      "label": "neutral"
   },
   {
      "text": " 00 do you feel any need to pay up if I word the claim as, It's possible you owe me $50. 00.  Like sure.  It's possible",
      "label": "neutral"
   },
   {
      "text": " But without empirical evidence it's not something you need to take seriously",
      "label": "neutral"
   },
   {
      "text": " And if lean on that possibility like it counts as evidence then I'm just being troll It's the exact same way for religious claims Insisting that this or that is possible when evidence is sorely needed is just dishonest tactic to muddy the waters The possibility of evidence versus actual evidence",
      "label": "neutral"
   },
   {
      "text": " And the point of this thread is - don't bother",
      "label": "neutral"
   },
   {
      "text": " When discussing the idea of whether morality exists objectively or subjectively, people will sometimes insist that God-given morality is not objective morality, that the only way morality could be objective is if not even God Himself could change it",
      "label": "neutral"
   },
   {
      "text": " But by that definition of objectivity, most things that exist would be subjective",
      "label": "neutral"
   },
   {
      "text": " I think it should be considered from the other way around: rather than objective being considered existing outside of the influence of an mind, it should be considered as existing outside of the influence of you mind",
      "label": "neutral"
   },
   {
      "text": " For instance, Critic says Movie is an 8/10",
      "label": "neutral"
   },
   {
      "text": " That is a subjective rating; Critic could change their mind and say Movie is a 10/10 and it would be no less true than their first review",
      "label": "neutral"
   },
   {
      "text": " But at the same time, that subjective rating objectivel exists; yo cannot change you mind about what Critic believes and have it be equally true to what they actually, objectivel believe So from that conception of objectivity, if God exists, then even though He could change morality, even though it is subjective to Hi , it is objective to u",
      "label": "neutral"
   },
   {
      "text": " Laws are subjective to the whims of the current government, but good luck arguing in any court that that means they don't objectively exist Everything that exists, exists objectively",
      "label": "neutral"
   },
   {
      "text": " I begin by defining a contrary opinion, before I will explain my broader argument",
      "label": "neutral"
   },
   {
      "text": " It's a matter of faith (pretending to know things I don't really know)",
      "label": "neutral"
   },
   {
      "text": " when its frozen!) Literally every miracle claim is an example of this",
      "label": "neutral"
   },
   {
      "text": " An intelligent being known as god created the universe! For this one just taking the intelligent aspect",
      "label": "neutral"
   },
   {
      "text": " All the evidence we have so far shows that intelligence comes either A) from a creator (like a computer A. I",
      "label": "neutral"
   },
   {
      "text": " ) or B) after an incredibly long and complex process",
      "label": "neutral"
   },
   {
      "text": " Neither of these are compatible with beginning everything",
      "label": "neutral"
   },
   {
      "text": " It's all just science claims that have terrible support Every miracle claim (including that an intelligent god exists) is a failed scientific claim without evidence",
      "label": "neutral"
   },
   {
      "text": ": The problem is, this is simply not true",
      "label": "neutral"
   },
   {
      "text": ": Others will follow if necessary",
      "label": "neutral"
   },
   {
      "text": ": It’s a fairly straightforward story, but there exists a serious contradiction",
      "label": "neutral"
   },
   {
      "text": ": They are wildly different, which obviously doesn’t bode well",
      "label": "neutral"
   },
   {
      "text": ": Or perhaps you could consult Moses",
      "label": "neutral"
   },
   {
      "text": ": And on and on and on",
      "label": "neutral"
   },
   {
      "text": ": It repeatedly makes claims that are simply not true",
      "label": "neutral"
   },
   {
      "text": ": There are still more, and I wouldn’t just unload them all on the first post",
      "label": "neutral"
   },
   {
      "text": ": We went through 1000s of years of thinking illness was demonic possession, it would have helped countless people if we could've skipped that and go straight to modern medicine or beyond If the point of the Bible is to help people, why does it not include any actually useful information",
      "label": "neutral"
   },
   {
      "text": ": Let me make it clear I’m not religious",
      "label": "neutral"
   },
   {
      "text": ": Free will is not an argument against consequences",
      "label": "neutral"
   },
   {
      "text": ": If a cop tells you that he will give you a ticket if you speed, you still have the free will to speed, but you may have to suffer the consequence of a ticket Like I said, I’m not religious but I think that argument isn’t necessarily good",
      "label": "neutral"
   },
   {
      "text": ": Hey everyone, My  emphasis is on Some",
      "label": "neutral"
   },
   {
      "text": ": However, it seems that Some of them do",
      "label": "neutral"
   },
   {
      "text": ": What do I mean by  'extreme modesty I mean Modesty in many areas of life where it seems  modesty would not be required or to be excessive",
      "label": "neutral"
   },
   {
      "text": ": Just by virtue of being from that city or state",
      "label": "neutral"
   },
   {
      "text": ": They said, Where are  your morals",
      "label": "neutral"
   },
   {
      "text": ": Example # 3(Real Example:Television I  have been watching a lot of Italian television and noticed that the  character will say something",
      "label": "neutral"
   },
   {
      "text": ": Then regret it and apologize",
      "label": "neutral"
   },
   {
      "text": ": But they are  much more expressive of emotion",
      "label": "neutral"
   },
   {
      "text": ": I heard the English Speaking  audience say they are Drama Queens Example #4(Real Example: Soccer The  American Soccer Coach wears a plain t-shirt",
      "label": "neutral"
   },
   {
      "text": ": While many of the Soccer  Coaches in Europe wear suits",
      "label": "neutral"
   },
   {
      "text": ": Now some people say that its his personal  choice",
      "label": "neutral"
   },
   {
      "text": ": Some people said that audience  will dislike them if they started giving more honest answers Example #6(Conversations Closely  related to #5, I noticed that in France and Italy people talk more  about Intellectual topics and you can name dropped thinkers",
      "label": "neutral"
   },
   {
      "text": ": I  am still studying German Culture in more depth hence, I can't guarantee  it happens there as well but I have see it in the English Speaking  Countries Conclusion :  There are just a few examples, I could go on and on",
      "label": "neutral"
   },
   {
      "text": ": But you guys get  the idea",
      "label": "neutral"
   },
   {
      "text": ": It doesn't say after 500 years, use the modern cultural values",
      "label": "neutral"
   },
   {
      "text": ": The moral relativist trolls can hold their horses",
      "label": "neutral"
   },
   {
      "text": ": Pedophilia being gross is not new",
      "label": "neutral"
   },
   {
      "text": ": I just felt like I had to include it",
      "label": "neutral"
   },
   {
      "text": ": As humans, we collaborate and cooperate, but also challenge each other and compete against one another",
      "label": "neutral"
   },
   {
      "text": ": There is nothing in the entirety of human history dating back to the origin of human existence that suggests we were ever anything different, or that we are destined to become one with an external, supernatural being that has the ability to collect our souls and transfer us into another realm entirely, on the condition that we pledged our utmost unquestioning and unadulterated obedience and submission to that supreme entity The reality of human nature is slandered by the Bible and Christianity itself as a way to exercise control and power over the common population, where critical thinking was underdeveloped, education was scarce, and superstition and ignorance was at the forefront of the majority of people in Biblical times, especially regarding the history and culture of the stories depicted Lying, stealing, cheating, hating, murdering (and don't forget mass fucking and orgies) . .",
      "label": "neutral"
   },
   {
      "text": ": other animals, namely mammals (which human beings would be categorized as if we were put in the same box under the same labels as the animal kingdom) are capable of doing all of those things, and there is no evidence to suggest otherwise Animals are also capable of altruism, self-sacrifice and teamwork, something which humans would highly regard and value as honorable and noble",
      "label": "neutral"
   },
   {
      "text": ": What a human being would consider as having integrity and honesty, is really just in the grand scheme of things a survival mechanism Human beings work better together, than against each other, and that's that",
      "label": "neutral"
   },
   {
      "text": ": Here is what came to mind. .  Part 1",
      "label": "neutral"
   },
   {
      "text": ": Where did we come from Where did we come from? First, let’s admit that nobody knows",
      "label": "neutral"
   },
   {
      "text": ": How do we come to know anything? Oftentimes, it’s by reasoning about observations",
      "label": "neutral"
   },
   {
      "text": ": So, let’s start with one of the simplest observations",
      "label": "neutral"
   },
   {
      "text": ": It appears that there is something rather than nothing",
      "label": "neutral"
   },
   {
      "text": ": Planets, trees, paperclips, and we ourselves appear to be here",
      "label": "neutral"
   },
   {
      "text": ": Most of us agree with this observation, and if we didn’t, there’d be nothing to explain, so for sake of conversation, let’s assume for now that we do in fact exist Supposing stuff does exist, it seems reasonable to ask how it got here - where did it come from? The fact that we think an explanation is needed here implies that we all share a certain idea of what counts as a good explanation",
      "label": "neutral"
   },
   {
      "text": ": Oil and vinegar is a good explanation for salad dressing; eating soap is a good explanation for getting sick; and the idea that the world is round is a good explanation for how a traveler moving in any straight line will eventually arrive where she started But it’s easy to imagine how things could have been different",
      "label": "neutral"
   },
   {
      "text": "Salad dressing could have been made from other ingredients; the kid who ate soap might have already been sick from a stomach flu; and the world could have been more ovular in shape",
      "label": "neutral"
   },
   {
      "text": "So the fact that we think explanations are needed implies that certain things do demand explanation",
      "label": "neutral"
   },
   {
      "text": "And the fact that some explanations are better than others implies that we all have certain standards for what counts as a good explanation Let’s explore some possible explanations for all this stuff in our world",
      "label": "neutral"
   },
   {
      "text": "First, it could be that it all came from nothing",
      "label": "neutral"
   },
   {
      "text": "But this seems like a pretty unsatisfying explanation because it doesn’t actually explain anything",
      "label": "neutral"
   },
   {
      "text": "Even on the quantum scale, where photons appear to come from nowhere, we have no current explanation for how this happens",
      "label": "neutral"
   },
   {
      "text": "But just because we don’t know the explanation doesn’t mean it can’t be explained one day according to natural laws",
      "label": "neutral"
   },
   {
      "text": "There are innumerable examples in history of solving mysteries in this way If we were to conclude that something came from nothing, then our definition of nothing must be wrong because if something came from it, then it wasn’t really nothing to begin with",
      "label": "neutral"
   },
   {
      "text": "That’s just true by definition",
      "label": "neutral"
   },
   {
      "text": "Something can surely come from something else",
      "label": "neutral"
   },
   {
      "text": "Of course, this explanation might not be immediately satisfying because it implies an infinite regress of causes - a cosmic passing of the buck",
      "label": "neutral"
   },
   {
      "text": "We have an intuition that there must be a first cause - the original stuff",
      "label": "neutral"
   },
   {
      "text": "The problem is that if there is a first cause, we’re right back at square one, looking for an explanation for that stuff It’s in situations like these that we should reflect on our assumptions and whether they could be wrong",
      "label": "neutral"
   },
   {
      "text": "Ok, but if we think this, we’ve drastically lowered our bar for what counts as a good explanation",
      "label": "neutral"
   },
   {
      "text": "All along we’ve been assuming that nothing means there is objectively nothing present, and infinity refers to something that is objectively endless",
      "label": "neutral"
   },
   {
      "text": "We think of them as polar opposites",
      "label": "neutral"
   },
   {
      "text": "So nothing and infinity have something interesting in common",
      "label": "neutral"
   },
   {
      "text": "When we try to describe them at the elemental level, we can describe them both as energetic states",
      "label": "neutral"
   },
   {
      "text": "There’s an adage that fish will be the last to discover water",
      "label": "neutral"
   },
   {
      "text": "This is an apt analogy here because it shows how one and the same substance can be perceived as both vast and absent, depending on one’s point of view",
      "label": "neutral"
   },
   {
      "text": "Fish might not notice water because it uniformly permeates everything in their world, much like humans once believed that the air in our atmosphere is empty space; to a bird, of course, there is nothing empty about air In daily life, we think of nothing in an absolute sense because it appears to be empty, static, and uniform relative to our lived experience",
      "label": "neutral"
   },
   {
      "text": "But to mistake this state for truly nothing in an absolute sense just reveals our own bias - much like we conceive of the earth as being motionless",
      "label": "neutral"
   },
   {
      "text": "From a broader perspective, it can only be described as motionless relative to us This relational property of the universe means that nothing and infinity might not be polar opposites",
      "label": "neutral"
   },
   {
      "text": "Imagine a person who believes that the earth is flat and can’t conceive of it being any other way",
      "label": "neutral"
   },
   {
      "text": "If this person were to travel in a perfectly straight line, say, Eastward, along the equator, eventually they would return to their origin point",
      "label": "neutral"
   },
   {
      "text": "The flat earther would be astonished",
      "label": "neutral"
   },
   {
      "text": "In their mind, East and West are polar opposites",
      "label": "neutral"
   },
   {
      "text": "So, they might think they had traveled through a wormhole hole",
      "label": "neutral"
   },
   {
      "text": "Of course, we know that East and West are not strict opposites, and the traveler’s reappearing act can be easily explained by assuming the earth is spherical",
      "label": "neutral"
   },
   {
      "text": "But to achieve that understanding, we had to think in three dimensions instead of two",
      "label": "neutral"
   },
   {
      "text": "Likewise, the seemingly mysterious properties of nothingness and infinity could be an indication that they are not the polar opposites that they appear to be in our three-dimensional perspective, but are closely related properties of a higher-dimensional phenomenon The lesson here is that nothing and infinity could conceivably be, not absolute states, but relational states, two manifestations of a single fundamental entity",
      "label": "neutral"
   },
   {
      "text": "If emptiness and infinity are ultimately manifestations of the same thing, then it’s meaningless to ask what caused stuff to come into being because, at the most fundamental level that we can comprehend, something has always been there",
      "label": "neutral"
   },
   {
      "text": "It’s the changes in that cosmic stuff, the temporary perturbations that, like waves on the ocean’s surface, form the relational states that we know as life It’s a bewildering thought",
      "label": "neutral"
   },
   {
      "text": "And I'm the first to admit that I have no idea what lies beyond our three-dimensional existence",
      "label": "neutral"
   },
   {
      "text": "In the meantime, we have a choice: we can take that mystery on faith, or we can study it, measure it, test it, challenge and revise our own assumptions until we achieve, however slightly, a richer understanding of this amazing world we live in Part 2",
      "label": "neutral"
   },
   {
      "text": "How should we behave Holding aside questions about the nature of the universe, there remains a more practical question",
      "label": "neutral"
   },
   {
      "text": "But there’s reason to believe that it’s not a lost cause",
      "label": "neutral"
   },
   {
      "text": "The challenge is this: to develop systems of cooperation that sustain themselves on the basis of rules that are likely to be honored by individuals with competing interests",
      "label": "neutral"
   },
   {
      "text": "But that’s a hard sell because sometimes it also feels good to be selfish, so this makes it hard to know when to follow which motivation",
      "label": "neutral"
   },
   {
      "text": "Another motivation could be that it’s ultimately in our best interest to make sacrifices now for greater gains later",
      "label": "neutral"
   },
   {
      "text": "For example, forgoing a paycheck now to finish a high-school education could help a graduate cultivate the skills and resources they need to earn a larger paycheck later and serve both themselves and their community in a more effective way",
      "label": "neutral"
   },
   {
      "text": "Giving up drinking now could help someone be a better parent, which in turn will tend to help to raise a healthier, more virtuous child, and thus a healthier future relationship that benefits both parties much more than the instant gratification that alcohol could bring",
      "label": "neutral"
   },
   {
      "text": "But for such a motivation to be adopted, people really need to believe it, and to really believe it, it needs to usually prove itself true",
      "label": "neutral"
   },
   {
      "text": "They are systems of rules that purport that good things will come to those who follow their rules",
      "label": "neutral"
   },
   {
      "text": "But does the Golden Rule always deliver on its promises? Of course not",
      "label": "neutral"
   },
   {
      "text": "It’s just a rule of thumb",
      "label": "neutral"
   },
   {
      "text": "Many of these great efforts to get people to follow the rules have won the hearts of particular individuals",
      "label": "neutral"
   },
   {
      "text": "But none of them have won the hearts of all mankind",
      "label": "neutral"
   },
   {
      "text": "I think this is because, for some people to be adequately motivated, they require stronger evidence that the rules will tend to deliver on their promises",
      "label": "neutral"
   },
   {
      "text": "For many people, that means discovering a set of rules that generate payoffs in this lifetime So, how can we discover such a set of rules? The scientific method suggests that we should be able to discover such rules through the systematic observation of our own world—that’s the only place we can observe after all",
      "label": "neutral"
   },
   {
      "text": "One starting point might be to observe the people for whom the rules are clearly not working: the downtrodden, who have labored hard each day simply for a roof over their head and a meal in their belly, and still have nothing to show for it",
      "label": "neutral"
   },
   {
      "text": "The sinners, who abuse others for personal gratification",
      "label": "neutral"
   },
   {
      "text": "To do that, we need to study what’s failing them",
      "label": "neutral"
   },
   {
      "text": "Is it a systemic, economic problem, like the lack of mechanisms for upward mobility? Is it the lack of mental health resources necessary to persist in the face of these obstacles? A combination? There may be hundreds, or thousands, of barriers to thriving, and the prevalence of these societal problems is evidence that much more work is needed to be done to identify the changes to the rulebook that are needed to promote thriving",
      "label": "neutral"
   },
   {
      "text": "But a partial answer is that stealing is wrong to the extent that we can consistently demonstrate situations in which individuals who forgo stealing from one another both do better in the long run",
      "label": "neutral"
   },
   {
      "text": "We have vast libraries of scientific knowledge about how matter behaves and the rules of what can cause what",
      "label": "neutral"
   },
   {
      "text": "The cost of getting in a serious car accident while driving to the grocery store on a given day is certainly worse than the cost of not driving to the store that day",
      "label": "neutral"
   },
   {
      "text": "And if the odds of getting into an accident were 50/50, it would indeed be rational to stay home and order your groceries online, even if that’s more expensive in the short term",
      "label": "neutral"
   },
   {
      "text": "But the odds of getting into a car accident on a given day are not 50/50, and we know this from hard data",
      "label": "neutral"
   },
   {
      "text": "The risk is not zero, but it’s small enough that we could justifiably conclude that driving to the grocery store is worth the risk",
      "label": "neutral"
   },
   {
      "text": "But as we have discussed, we have other good reasons for being good Most of us are seekers of truth, but we vary in our standards of proof for deciding what’s true",
      "label": "neutral"
   },
   {
      "text": "Those who adopt a scientific perspective are not ready to give up on natural explanations because, over the long term, their approach has an unsurpassed track record",
      "label": "neutral"
   },
   {
      "text": "This is because they commit themselves to an extremely high standard of proof",
      "label": "neutral"
   },
   {
      "text": "Their approach is not a quick fix - it’s a slow and laborious process",
      "label": "neutral"
   },
   {
      "text": "But even if they fail to answer the biggest questions in the end, their efforts will not be in vain because their journey can only bring us closer",
      "label": "neutral"
   },
   {
      "text": "That’s the beauty of the scientific perspective - it’s amenable to revision and improvement",
      "label": "neutral"
   },
   {
      "text": "But he'd have his work cut out for him because, to persuade a scientist of an extraordinary claim, one must have extraordinary evidence",
      "label": "neutral"
   },
   {
      "text": "Mere voices and miracles are not enough since those can likely be explained as hallucinations or illusions",
      "label": "neutral"
   },
   {
      "text": "So I have no worries about eternal damnation",
      "label": "neutral"
   },
   {
      "text": "That’s a risk I’m willing to take I don't expect all readers to agree with me about all this",
      "label": "neutral"
   },
   {
      "text": "And I still think individuals can lead a good life without enlisting in the scientific worldview",
      "label": "neutral"
   },
   {
      "text": "Not everyone needs to be guided by that view, just like not everyone needs to be a plumber",
      "label": "neutral"
   },
   {
      "text": "But it's a good thing that we have plumbers",
      "label": "neutral"
   },
   {
      "text": "And for those of us who are not, it behooves us to learn a thing or two about how a toilet works",
      "label": "neutral"
   },
   {
      "text": "It has been quite some time since my last pos on here",
      "label": "neutral"
   },
   {
      "text": "Today, I briefly return with some reflections on a few relatively recent theodicies, I've come across that I think are difficult to respond to",
      "label": "neutral"
   },
   {
      "text": "Be it the occurrence of evil and suffering generally, or more concrete horrific examples of evil or suffering such as a Fawn burning to death in a forest fire",
      "label": "neutral"
   },
   {
      "text": "There is taken to be two kinds of problem of evil",
      "label": "neutral"
   },
   {
      "text": "An evidentia , and a logica version",
      "label": "neutral"
   },
   {
      "text": "A logical problem of evil, argues that theism and the occurrence of evil are jointly inconsistent",
      "label": "neutral"
   },
   {
      "text": "There are many ways to formulate such an argument that atheist philosophers have come up with, there are inductive formulations, intuition-based formulations, Bayesian formulations etc",
      "label": "neutral"
   },
   {
      "text": "One would be a defense, another would be a theodicy",
      "label": "neutral"
   },
   {
      "text": "A defense is a response to a logical problem of evil, it is a story one can tell, which, when conjoined with theism, makes theism and the existence of evil compossible",
      "label": "neutral"
   },
   {
      "text": "The most famous example is Alvin Plantinga's free will defens",
      "label": "neutral"
   },
   {
      "text": "It's important to note that, a defense, does not need to be remotely likely, or plausible, it only needs to be true for all one knows and not entail a logical contradiction A theodicy, on the other hand, is a response to the evidential problem of evil",
      "label": "neutral"
   },
   {
      "text": "Unlike a defense, a theodicy must be a story which is plausibly actually true, not just true for all one knows",
      "label": "neutral"
   },
   {
      "text": "Before reading this section, I highly recommend watching Apologetic Squared's short 7 minute vide on this theodicy or reading the original pape on it",
      "label": "neutral"
   },
   {
      "text": "I will just give a brief sketch of it The basic idea is this; what makes me, me, and you, you, is our essential properties",
      "label": "neutral"
   },
   {
      "text": "And, the story goes, our essential properties include (and are possibly exhausted by) facts about our origins, indeed very specific facts about our origins, including the total causal history which has resulted in ones coming-to-be, our ancestral history, and evolutionary history",
      "label": "neutral"
   },
   {
      "text": "But this history includes a lot of suffering",
      "label": "neutral"
   },
   {
      "text": "This seems reasonably plausible on it's own",
      "label": "neutral"
   },
   {
      "text": "It seems like, at least partly, what would make me numerically distinct from an identical clone of myself would be my origins",
      "label": "neutral"
   },
   {
      "text": "Perhaps my clone was created in a test-tube using my DNA, whereas I was created through regular human reproduction etc",
      "label": "neutral"
   },
   {
      "text": "So my origins are an essential property of me, if those weren't my origins, I wouldn't be me",
      "label": "neutral"
   },
   {
      "text": "This strikes me as unintuitive in the extreme",
      "label": "neutral"
   },
   {
      "text": "While an object like you are me, could not have a entirely different origin, it seems like we could have a slightly different origin",
      "label": "neutral"
   },
   {
      "text": "That is, it seems like some degree of modal tolerance is permissable",
      "label": "neutral"
   },
   {
      "text": "Suppose I didn't believe my great grandfather fought in the first world war, but then my father tells me he did",
      "label": "neutral"
   },
   {
      "text": "It doesn't seem, in the slightest, that I'm learning about who I am, that is, learning about my essential characteristics",
      "label": "neutral"
   },
   {
      "text": "Or that, if it later turned out my grandfather did not fight in WW1, I would be finding out that I'm a different person than I previously thought I was, that seems utterly bizarre",
      "label": "neutral"
   },
   {
      "text": "On the other hand, if I found out that I am a brain in a vat, or a clone created in a test-tube, it seems like I would indeed be shocked to find out that I am not who I thought I was! But then, if not every fact about our origins is essential, what facts are and aren't? On reflection, one answer with some plausibility, is the essential part of my origin is the event of my father's sperm fertilizing my mother's egg, and the set of pre-natal embryonic states which followed etc",
      "label": "neutral"
   },
   {
      "text": "That is, what is relevent to an object or persons origins, is the causal history of the material out of which it was originally constituted",
      "label": "neutral"
   },
   {
      "text": "What makes the desk on which I am typing, *this* desk, is the history of the wood and nails which constitutes it",
      "label": "neutral"
   },
   {
      "text": "A view such as this is often used in tandum with Kripke's causal theory of reference",
      "label": "neutral"
   },
   {
      "text": "For a technical paper on this see her But suppose we even grant (as I would not) that every state of affairs which forms part of the causal chain ultimately leading to my birth, stretching back even to specific facts related to our evolutionary history, are an essential part of my origins as the argument needs",
      "label": "neutral"
   },
   {
      "text": "There is now a further question",
      "label": "neutral"
   },
   {
      "text": "So your origin and my origin is surely the same or same enough, our existence/essential properties would be preserved",
      "label": "neutral"
   },
   {
      "text": "Yet, the extremely undesirable experiences felt by persons and sentient non-persons leading up to us, would be greatly diminished",
      "label": "neutral"
   },
   {
      "text": "So, it would seem phenomenal content does not necessarily depend on certain physical states, you can have different phenomenal contents despite changes in physical states",
      "label": "neutral"
   },
   {
      "text": "Finally, even if a change in the specific phenomenal contents like pain, entails a change in physical states, it seems like only minor changes, utterly irrelevant to our material origins are required",
      "label": "neutral"
   },
   {
      "text": "I will address this in turn Scott characterizes the origin essentialism he accepts as follows Assembly Origin Essentialism: If the materials from which a creature originated were assembled by a process that was too different, then that creature would not have existed",
      "label": "neutral"
   },
   {
      "text": "At first blush, there doesn't seem to be an issue",
      "label": "neutral"
   },
   {
      "text": "But, it is left ambiguous what is precisely meant by too different",
      "label": "neutral"
   },
   {
      "text": "Scott and I, are going to disagree on the threshold",
      "label": "neutral"
   },
   {
      "text": "Be that as it is, Scott gives 3 justifications for why an Assembly Origin Essentialism should be strong enough to motivate the non-identity theodicy My first argument is that intervening in the world in the ways described in Waiting and Painless Evolution constitutes changes that are too big",
      "label": "neutral"
   },
   {
      "text": "At most a proponent of Assembly Origin Essentialism should allow a few minor changes to the process by which the materials  from which I arose are assembled such as the one in Forbes' example",
      "label": "neutral"
   },
   {
      "text": "On the other hand,  the miracles required in Waiting and Painless Evolution require big changes to the process",
      "label": "neutral"
   },
   {
      "text": "So my origin is not preserved in such cases",
      "label": "neutral"
   },
   {
      "text": "This, however, is not a requirement",
      "label": "neutral"
   },
   {
      "text": "Afterall, it doesn't seem like a T-Rex mauling a Brochosaurus alive, or even my mother's pre-birth agony, is absolutely necessary for me, or Bob's, or anybody elses origins",
      "label": "neutral"
   },
   {
      "text": "The material out of which we originated could have an identical, or, intuitively, an identical enough history, such that I am still me and you are still you, sans such horrors",
      "label": "neutral"
   },
   {
      "text": "So there are further burden-shifting grounds to reject Scott's claim My second argument is that accepting such a strong variant of origin essentialism yields a gain in explanatory power. .",
      "label": "neutral"
   },
   {
      "text": "That is a significant gain in explanatory power for the theist",
      "label": "neutral"
   },
   {
      "text": "I just have a couple points here",
      "label": "neutral"
   },
   {
      "text": "There seems to be no principled way to say when an origin becomes so different that it fails to preserve the existence of an organism other than never or always",
      "label": "neutral"
   },
   {
      "text": "And if we are antecedently attracted to Assembly Origin Essentialism, it isn’t plausible to hold that a change in origin never yields a different organism",
      "label": "neutral"
   },
   {
      "text": "So we should say that any change at all in the process by which the materials of my origin were assembled yields a different mere duplicate of me rather than me",
      "label": "neutral"
   },
   {
      "text": "This argument has more bite than the other two, but I think it is defeasible",
      "label": "neutral"
   },
   {
      "text": "I agree that if you hold that any change whatsoever in the causal history of ones origins is a change in the essential properties of some object or organism then that does indeed eliminate vagueness and arbitrariness, and, prima facie, this does seem to be a problem for views which are restrictive",
      "label": "neutral"
   },
   {
      "text": "But, so too would positing that having any strands of hair, constitutes non-baldness, or positing that any collection of 2 or more grains of sand constitutes a pile",
      "label": "neutral"
   },
   {
      "text": "We have an intuitive, conventional understanding of what a pile is, and what non-baldness is, and these views, while having the virtue of eliminating vagueness, simply do not track our concepts",
      "label": "neutral"
   },
   {
      "text": "This is analogous to radical origin essentialism, it simply doesn't track my, and I think our shared intuitive understanding of what makes us, us, and I take myself to have illustrated why this is so, above",
      "label": "neutral"
   },
   {
      "text": "If vagueness is a cost of maintaining such a view, then it's one I gladly pay, with the hopes that one day we do discover a restrictive criterion for essentiality of origins, which avoids issues of vague predicates Objection 2 Suppose we forgo the first objection, and agree that a very radical kind of origin essentialism is true",
      "label": "neutral"
   },
   {
      "text": "It rests on the intuition that the existence of you, and you in particular, your mother and father, your best friends and the love of your life, and those people in the actual world who satisfy those descriptions in particular are valuable in themselves, for their own sake",
      "label": "neutral"
   },
   {
      "text": "But suppose I asked you what makes them valuable, or at least, why you value them so dearly",
      "label": "neutral"
   },
   {
      "text": "Plausibly, you'd list out the set of things they've done for you, the bad times they were there to help you get through, the virtues and other admirable qualities they embody, possibly some physical features if you know what I mean",
      "label": "neutral"
   },
   {
      "text": "Among other things in that ballpark",
      "label": "neutral"
   },
   {
      "text": "It would be very odd for you to list off a specific set of essential properties related to their origins like that a great ape was eaten alive by an alligator billions of years ago",
      "label": "neutral"
   },
   {
      "text": "In fact, if you were to do that, I'd probably try to contact a mental health clinician",
      "label": "neutral"
   },
   {
      "text": "What this tells me is, while it can be granted that there are essential properties related to my origins that make me, me, rather than someone else",
      "label": "neutral"
   },
   {
      "text": "These essential features are, in fact, accidental if we zoom out and ask what stands in the right sort of making-relation in terms of my value properties",
      "label": "neutral"
   },
   {
      "text": "I'm not valuable in virtue of exemplifying certain goods, I'm just valuable as such",
      "label": "neutral"
   },
   {
      "text": "Even this, however, won't do",
      "label": "neutral"
   },
   {
      "text": "This again, just doesn't appear plausible on reflection and would need to be motivated But even if it is motivated, there is of course an issue of whether the value of contrastively actualizing me, rather than a qualitatively identical counterpart with a different origin that doesn't involve as much horrific suffering, is so great that it outweighs the aforementioned horrific suffering which was permitted",
      "label": "neutral"
   },
   {
      "text": "This, of course, is even more implausible",
      "label": "neutral"
   },
   {
      "text": "More on this later Objection 3 The last objection I will present will be an undercutting one, from Kantian (or other deontological) duties",
      "label": "neutral"
   },
   {
      "text": "In actuality though, this theodicy is the furthest thing from an endorsement of Kantian ethics, and is in fact radically consequentialist",
      "label": "neutral"
   },
   {
      "text": "That is, he treats rational agents as a mere means to bring about other rational agents with certain essential traits, He fails to treat rational agents as ends in themselves",
      "label": "neutral"
   },
   {
      "text": "No contemporary Kantian in the known universe would find such actions tolerable, and Kant himself would most likely be rolling in his grave",
      "label": "neutral"
   },
   {
      "text": "As a related point, even  the vast majority of consequentialists would find the kind of normative framework this theodicy requires implausible in the extreme",
      "label": "neutral"
   },
   {
      "text": "The catch being, for free creatures to participate in the creation of the ideal world, the world must start out non-ideal, indeed it might start out in the very notably far from ideal situation we find ourselves, with great amounts of creaturely suffering",
      "label": "neutral"
   },
   {
      "text": "The first is that it avoids a lot of the pitfalls of most other responses to the problem of evil, such as moral paralysis, the existence of apparently gratuitous evils, explanations for natural evils or animal suffering,  why a better state of affairs was not actualized etc",
      "label": "neutral"
   },
   {
      "text": "It is not without issues, but it is I think a quite impressive feature that it is able to sidestep many of the traditional problems that other theodicies run afoul of",
      "label": "neutral"
   },
   {
      "text": "strike",
      "label": "neutral"
   },
   {
      "text": "John Kiriakou | Ex -CIA whistleblower | #44 Homeless Romantic Podcast",
      "label": "neutral"
   },
   {
      "text": "A Community for OSINT Collaboration and Networking!",
      "label": "neutral"
   },
   {
      "text": "Fiber-optic Submarine Cable near Faroe and Shetland Islands Damaged; Mediterranean Cables also Cut",
      "label": "neutral"
   },
   {
      "text": "AQ future",
      "label": "neutral"
   },
   {
      "text": "Israel",
      "label": "neutral"
   },
   {
      "text": "firefight",
      "label": "neutral"
   },
   {
      "text": "Articles in English",
      "label": "neutral"
   },
   {
      "text": "Short Documentary",
      "label": "neutral"
   },
   {
      "text": "Highschool Student Looking for an Afghan to interview",
      "label": "neutral"
   },
   {
      "text": "cyber",
      "label": "neutral"
   },
   {
      "text": "Following that cleanup were you demoted or disciplined? prosecutor Susan Hoffinger asked.  Weisselberg replied, No",
      "label": "neutral"
   },
   {
      "text": "He said he was given a $200,000 raise in 2019 I told them since the practice was no longer going on I would need some additional income to pay for those expenses, he said Asked if the brothers had filled their in father on what had happened, he said, I don’t know what they told their dad",
      "label": "neutral"
   },
   {
      "text": "Don Young, who died in Marc at the age of 88",
      "label": "neutral"
   },
   {
      "text": "Nick Begich, the grandfather of this year’s candidate by the same name, was presumed to have been killed in a plane crash Even before the race had been called, Palin, the late Sen",
      "label": "neutral"
   },
   {
      "text": "Circuit Court of Appeal on Monday",
      "label": "neutral"
   },
   {
      "text": "Everyone has their own style, but when it means others can’t ascend into leadership, then it seems a little bit unfair.  Reps.  Hakeem Jeffries, D-N",
      "label": "neutral"
   },
   {
      "text": "Y, 52, and Katherine Clark, D-Mass, 59, appear to have locked up support for the No.  1 and No",
      "label": "neutral"
   },
   {
      "text": "Pete Aguilar, D-Calif, 43, a member of the Hispanic Caucus, had originally sought the assistant post, which had been considered the No",
      "label": "neutral"
   },
   {
      "text": "Under that scenario, Aguilar's caucus chair role would move up to No",
      "label": "neutral"
   },
   {
      "text": "3 and Clyburn's assistant role would move down to No.  4",
      "label": "neutral"
   },
   {
      "text": "After months of reaching out to colleagues, he had that job mostly locked up",
      "label": "neutral"
   },
   {
      "text": "Asked how it felt to be leaving leadership after two decades, Hoyer replied with a chuckle: Not good, not good.",
      "label": "neutral"
   },
   {
      "text": "This year, that would be Friday, Dec.  2",
      "label": "neutral"
   },
   {
      "text": "26, the Saturday following Thanksgiving",
      "label": "neutral"
   },
   {
      "text": "As of Friday, at least nine of the state’s 159 countie had opened up Nov",
      "label": "neutral"
   },
   {
      "text": "Senate, Murkowski tweete Wednesday night",
      "label": "neutral"
   },
   {
      "text": "I look forward to continuing the important work ahead of us",
      "label": "neutral"
   },
   {
      "text": "Kelley later dropped out and endorsed Tshibaka, but he remained on the ballot",
      "label": "neutral"
   },
   {
      "text": "Lisa Murkowski has been re-elected, and I congratulate her on that, Tshibaka said",
      "label": "neutral"
   },
   {
      "text": "In the race for Alaska's at-large House seat, incumbent Rep",
      "label": "neutral"
   },
   {
      "text": "WASHINGTON — Despite headlines of mass layoff in corporate America and fears of recession, it's still a worker's market for those looking to get temporary holiday jobs as retailers and shippers continue to battle for employees ahead of what they expect to be a record holiday shopping season",
      "label": "neutral"
   },
   {
      "text": "Companies have been drastically speeding up the hiring process to boost their staffing levels amid stiff competition for workers",
      "label": "neutral"
   },
   {
      "text": "Some have increased pay to more than $30 an hour in some markets, are offering up to $3,000 in signing bonuses or are holding mass hiring events to secure workers before they get better offers elsewhere, according to companies, recruiters and economists Retailers are entering the holiday season amid a swirl of mixed economic signals",
      "label": "neutral"
   },
   {
      "text": "Inflatio remains at the highest levels in decades and there has been an uptick in mass layoffs and hiring freezes, yet the unemployment rate is still relatively low and consumer spending has continued to be strong",
      "label": "neutral"
   },
   {
      "text": "That leaves companies expecting another busy shopping season as they continue to grapple with a competitive job market",
      "label": "neutral"
   },
   {
      "text": "It still is a very, very tough hiring environment, especially in states and cities with very low unemployment rates, said Julia Pollak, chief economist at ZipRecruiter",
      "label": "neutral"
   },
   {
      "text": "Employers tell us that they are still really struggling to find qualified candidates and to find motivated willing candidates",
      "label": "neutral"
   },
   {
      "text": "So, even when they sign candidates, they’re very worried about ghosting, that people won’t show up on day one, because people have so many alternatives and are taking the best offer that they get",
      "label": "neutral"
   },
   {
      "text": "Retailers expect holiday sales to be up 6% to 8%, with companies planning to hire 450,000 to 600,000 temporary workers — at the top end, that would be a dip from last year, and if retailers meet the bottom end of their hiring targets, it would be the lowest number of temporary hires since 2009, accordin to the National Retail Federation",
      "label": "neutral"
   },
   {
      "text": "The holiday hiring comes at a time when retailers were already employing the highest number of workers since 2016 and the number of transportation and warehouse workers are at record highs, according to the Bureau of Labor Statistics",
      "label": "neutral"
   },
   {
      "text": "Before the holiday hiring rush, retailers were already looking to fill 800,000 open positions, according to the retail federation But at the same time, that tight labor market has provided a benefit to retailers heading into the holiday season because it has driven up wages — giving consumers more money to spend even in a time of massive inflation The labor market is a real conundrum for employers and is one of the reasons consumers have behaved in such a resilient way because wages are increasing and there’s pressure on the market, and that keeps people spending, Matt Shay, president of the retail federation, said in a call with reporters earlier this month",
      "label": "neutral"
   },
   {
      "text": "There are some signs though that the labor market is starting to shift in employers' favor",
      "label": "neutral"
   },
   {
      "text": "Job seekers are looking for seasonal work at the highest rates since 2019 ,with searches up just over 16% from last year, according to data from Indeed",
      "label": "neutral"
   },
   {
      "text": "Meanwhile, seasonal job postings are 2% lower than last year, according to the hiring website We see fewer job postings than we saw last year and more people looking in that smaller pool of postings, and the result of that is workers might have a little less bargaining power than they had in the seasonal market last year, said Cory Stahle, a senior economist at Indeed",
      "label": "neutral"
   },
   {
      "text": "But we still are in this really tight labor market where even though things have cooled off a little bit, the labor market still remains really tight",
      "label": "neutral"
   },
   {
      "text": "For UPS, which is hiring 100,000 seasonal workers again this holiday season, it remains a war for candidates",
      "label": "neutral"
   },
   {
      "text": "The company has streamlined its hiring process, cutting out in-person interviews, so that within 25 minutes it is able to process an application, give a job offer and complete the required payroll paperwork for the vast majority of its openings, including warehouse workers, package handlers and drivers",
      "label": "neutral"
   },
   {
      "text": "Someone isn’t applying to one job, they’re applying to 10 jobs, and the company that best meets that candidate’s needs is going to end up winning that candidate, said Matt Lavery, UPS global director of sourcing, hiring and onboarding",
      "label": "neutral"
   },
   {
      "text": "We’re trying to increase our odds with every candidate by being as transparent, being direct and also paying a very good wage",
      "label": "neutral"
   },
   {
      "text": "The company is on track to meet its hiring goal, but some regions remain particularly difficult to find workers, such as Minneapolis, parts of New England like Cape Cod, Denver and the surrounding mountain communities",
      "label": "neutral"
   },
   {
      "text": "It’s really different stories within the country that you have to pay attention to and be very nimble and very agile to adjust to, Lavery said",
      "label": "neutral"
   },
   {
      "text": "Certain pockets may be a little better than last year, and in some areas it’s become extremely tough.  Macy’s Inc",
      "label": "neutral"
   },
   {
      "text": "has also been speeding up its hiring process with applications taking as little as five minutes and the majority of applicants getting an offer within 48 hours",
      "label": "neutral"
   },
   {
      "text": "The retailer will be adding 41,000 holiday workers at its Macy’s, Bloomingdale’s and Bluemercury stores starting at $15 an hour and is offering up to $500 in referral bonuses",
      "label": "neutral"
   },
   {
      "text": "This speed is imperative during holiday hiring, John Patterson, Macy’s vice president of talent, said in an email",
      "label": "neutral"
   },
   {
      "text": "While our application process is quick, we’re asking questions that matter",
      "label": "neutral"
   },
   {
      "text": "Last year, this enhanced, centralized hiring process allowed us to hire fewer colleagues of higher talent levels with more competitive pay who stayed on, resulting in a 40% reduction in turnover",
      "label": "neutral"
   },
   {
      "text": "Despite Amazon cuttin as many as 10,000 headquarter jobs, it said last month that it is planning to add 150,000 seasonal worker with an average starting pay for warehouse and delivery workers of $19 an hour and sign-on bonuses ranging from $1,000 to $3,000 The US",
      "label": "neutral"
   },
   {
      "text": "Postal Service will hire just half the number of people this year as last year, but officials say it is in a better staffing position going into the holidays than last year and has increased its automated processes to meet the rising demand",
      "label": "neutral"
   },
   {
      "text": "Postal officials assured members of Congress during a hearing earlier this month that they will have the staffing needed this holiday season and be able to avoid a scenario such as the one in 2020 when the agency  struggled to deliver packages by Christmas",
      "label": "neutral"
   },
   {
      "text": "We never have enough people, I’ve been here 25 years, but we manage",
      "label": "neutral"
   },
   {
      "text": "We move people around, people work overtime, people do extraordinary things, Edmund Carley, national president of the United Postmasters and Managers of America, said during the hearing",
      "label": "neutral"
   },
   {
      "text": "We’ve hired in the last couple of years over 400,000 people and we continue to hire, so I don’t think that I’m ever fully staffed",
      "label": "neutral"
   },
   {
      "text": "We’re always working, but we will deliver",
      "label": "neutral"
   },
   {
      "text": "It will be a successful season, I’m sure.",
      "label": "neutral"
   },
   {
      "text": "I know that he’s issued a statement",
      "label": "neutral"
   },
   {
      "text": "He said he didn’t know who those people were",
      "label": "neutral"
   },
   {
      "text": "Trump, who described the dinner on the back patio as quick and uneventful, is facing backlash for having dined with Ye and Fuentes Arkansas Gov",
      "label": "neutral"
   },
   {
      "text": "We need to avoid those kinds of empowering the extremes, Hutchinson said",
      "label": "neutral"
   },
   {
      "text": "And when you meet with people, you empower",
      "label": "neutral"
   },
   {
      "text": "And that’s what you have to avoid",
      "label": "neutral"
   },
   {
      "text": "You want to diminish their strength, not empower them.  Stay away from them",
      "label": "neutral"
   },
   {
      "text": "Hutchinson added that Trump did not have an accidental meeting with Ye: You have got to be absolutely clear in your communication that this is not acceptable dogma, it’s not acceptable conversation, it’s not acceptable history, and you have to disavow it",
      "label": "neutral"
   },
   {
      "text": "They want to do bad things to the greatest movement in the history of our country but in particular bad things to me, he said",
      "label": "neutral"
   },
   {
      "text": "Echoing language from his speech before the Jan",
      "label": "neutral"
   },
   {
      "text": "Capitol, he told attendees, You people have to fight.  You have to fight",
      "label": "neutral"
   },
   {
      "text": "You have to be strong",
      "label": "neutral"
   },
   {
      "text": "Cindy Hyde-Smith of Mississippi, Reps",
      "label": "neutral"
   },
   {
      "text": "This is Trump derangement syndrome but this time with a gun and badge.  #JusticeCorrupte , Cruz tweeted",
      "label": "neutral"
   },
   {
      "text": "He said he has experience with special prosecutors and independent counsels",
      "label": "neutral"
   },
   {
      "text": "They take forever to investigate and make a decision",
      "label": "neutral"
   },
   {
      "text": "Smit , known as Jack Smith, a prosecutor at The Hague and a former federal prosecutor, to begin serving as special counsel immediately",
      "label": "neutral"
   },
   {
      "text": "law, which requires spending money There’s a technical difference",
      "label": "neutral"
   },
   {
      "text": "I think that’s a fair thing to say, he said",
      "label": "neutral"
   },
   {
      "text": "The fact that the ambassador still sits at her residence here in the US",
      "label": "neutral"
   },
   {
      "text": "Maxine Waters, which has since been redrawn",
      "label": "neutral"
   },
   {
      "text": "These are sham investigations",
      "label": "neutral"
   },
   {
      "text": "They don’t have an agenda that will help Americans",
      "label": "neutral"
   },
   {
      "text": "No one has done the investigative research we’ve done on these investigators",
      "label": "neutral"
   },
   {
      "text": "People in glass houses shouldn’t throw stones, Herrig said",
      "label": "neutral"
   },
   {
      "text": "We have a multimillion-dollar budget, and we’re staffing up with a team of researchers and communicators",
      "label": "neutral"
   },
   {
      "text": "Herrig’s group is working with another, Courage for Americ , which just launched",
      "label": "neutral"
   },
   {
      "text": "It’s a very dangerous new caucus and we’re going to be there every single day making sure people know about it",
      "label": "neutral"
   },
   {
      "text": "Those include Media Matters and American Bridge, both of which he stepped away from to start Facts First Brock said an American Bridge donor has already pledged six-figures to support Facts First, which he said would likely have a $10 million budget over two years",
      "label": "neutral"
   },
   {
      "text": "Co-founders include former Republican Rep",
      "label": "neutral"
   },
   {
      "text": "We are doing this in response",
      "label": "neutral"
   },
   {
      "text": "Of the new groups, Brock’s appears to be working most closely with Hunter Biden and his legal team, led by entertainment lawyer Kevin Morris",
      "label": "neutral"
   },
   {
      "text": "Brock recently traveled to Los Angeles to meet with Hunter Biden and said he came away reassured I came out of that not nervous",
      "label": "neutral"
   },
   {
      "text": "To me, the main story here is of an addictive person who has mental health issues of the kind that are in most families in America.  . .",
      "label": "neutral"
   },
   {
      "text": "I also think it’s the story of Joe Biden as an empathetic father.",
      "label": "neutral"
   },
   {
      "text": "I'm always going to err on the side of overreacting to keep people safe, Penzone said",
      "label": "neutral"
   },
   {
      "text": "Until I felt that our detectives had a chance to get their arms around any potential threats that may do harm to him or his family, I was not going to allow for them to be in harm's way",
      "label": "neutral"
   },
   {
      "text": "We are not going to tolerate it, he said",
      "label": "neutral"
   },
   {
      "text": "They had a hiccup with the Powerball drawing last night, right? These things happen, but I would say to them, actually this should make them feel good because they see the type of redundancies that we have in place",
      "label": "neutral"
   },
   {
      "text": "Have some courage and speak out and say these types of threats aren’t okay against our opponents any more than they would be against us",
      "label": "neutral"
   },
   {
      "text": "Earlier this year the Treasury Department again allowed the California-based Chevron and other US",
      "label": "neutral"
   },
   {
      "text": "companies to perform basic upkeep of wells it operates jointly with state-run oil giant PDVSA Under the new policy profits from the sale of energy would be directed to paying down debt owed to Chevron, rather than providing profits to PDVSA Talks between the Maduro government and the Unitary Platform resumed in Mexico City on Saturday after more than a yearlong pause",
      "label": "neutral"
   },
   {
      "text": "Four other states — Alabama, Oregon, Tennessee and Vermont — passed similar legislation, effectively ending slave labor in prisons",
      "label": "neutral"
   },
   {
      "text": "His original bill read, Slavery and involuntary servitude are prohibited",
      "label": "neutral"
   },
   {
      "text": "Some of those voters, like Todd L",
      "label": "neutral"
   },
   {
      "text": "Its failure signifies remnants of a time many would like to forget It was a tricky bill to read if you had not done a little homework, said Sterling, owner of Alpha Media and Public Relation , an advertising agency in the state capital",
      "label": "neutral"
   },
   {
      "text": "Of course, I voted for the bill because it’s long past the time we eliminate any possibility of what’s going on at Angola",
      "label": "neutral"
   },
   {
      "text": "That should have been a slam dunk",
      "label": "neutral"
   },
   {
      "text": "But now we’re the only state that has something like on the books… And that’s embarrassing",
      "label": "neutral"
   },
   {
      "text": "Look at it this way: If the amendment failed, on Nov",
      "label": "neutral"
   },
   {
      "text": "9, we’d be no worse off than when we were on Nov.  8",
      "label": "neutral"
   },
   {
      "text": "But there’s a potential that we could have been worse if it had passed",
      "label": "neutral"
   },
   {
      "text": "… So, we need to go back to the drawing board and make sure that the language is clear so everybody knows exactly what the intent is",
      "label": "neutral"
   },
   {
      "text": "It’s terrible, said Robert Diggs, an attorney in Atlanta from Lafayette, Louisiana",
      "label": "neutral"
   },
   {
      "text": "I don’t see how there can be an excuse for confusing language on a bill, especially one as important as this",
      "label": "neutral"
   },
   {
      "text": "I looked around, like ‘Does anyone else see this?’ To see that on the ballot was shocking",
      "label": "neutral"
   },
   {
      "text": "What made matters even worse was that he was unsure of how to vote",
      "label": "neutral"
   },
   {
      "text": "Finally, he said, he voted yes",
      "label": "neutral"
   },
   {
      "text": "I was fearful that a ‘no’ vote would support keeping it as it is, and I’m not down for that at all",
      "label": "neutral"
   },
   {
      "text": "It’s really sad and makes me angry that we’re still dealing with this",
      "label": "neutral"
   },
   {
      "text": "That exception has been languishing on state constitutions for more than 100 years Curtis Ray Davis II, executive director for the abolitionist grou Decarcerate Louisiana, spent nearly 26 years in the Angola prison for a murder he said he did not commit",
      "label": "neutral"
   },
   {
      "text": "During his stint, he wrote the book Slave State: Evidence of Apartheid in America",
      "label": "neutral"
   },
   {
      "text": "He added that the confusing language was a form of voter suppression",
      "label": "neutral"
   },
   {
      "text": "But we won’t know that until we see it again.",
      "label": "neutral"
   },
   {
      "text": "We are innocent, he added",
      "label": "neutral"
   },
   {
      "text": "The extraordinary circumstances presented here demand it",
      "label": "neutral"
   },
   {
      "text": "She said Ornato told her Trump lunged at the steering wheel of the SUV he was in, demanding to be taken up Pennsylvania Avenue to the Capitol",
      "label": "neutral"
   },
   {
      "text": "Ornato’s attorney, Kate Driscoll, did not specifically address his appearance Tuesday",
      "label": "neutral"
   },
   {
      "text": "She told NBC News, Mr",
      "label": "neutral"
   },
   {
      "text": "Ornato has already testified, but Hutchinson’s testimony prompted the committee to call him back again",
      "label": "neutral"
   },
   {
      "text": "She decided to leave the administratio because, she said, she needed to focus on her family",
      "label": "neutral"
   },
   {
      "text": "Sad, and yet with the full realization and appreciation that all things must pass",
      "label": "neutral"
   },
   {
      "text": "Things can’t go on forever, Fauci said in an interview earlier in the day with NBC News",
      "label": "neutral"
   },
   {
      "text": "In his NBC interview, Fauci alluded to how his life has been upended",
      "label": "neutral"
   },
   {
      "text": "I'd prefer not to get into that, he said",
      "label": "neutral"
   },
   {
      "text": "The attacks and blowback I get are just not worth it",
      "label": "neutral"
   },
   {
      "text": "I can explain and defend everything I've done and I have absolutely nothing to hide",
      "label": "neutral"
   },
   {
      "text": "If you want to let nature take its course, we’re ultimately going to get there but we’re going to loose a lot more people than we need to",
      "label": "neutral"
   },
   {
      "text": "Fauci does not plan to retir",
      "label": "neutral"
   },
   {
      "text": "He told NBC News he is considering various paths that include working in academia, for a foundation or possibly on his own",
      "label": "neutral"
   },
   {
      "text": "He said it is highly likely he will write a book",
      "label": "neutral"
   },
   {
      "text": "6 Oath Keepers founder Elmer Stewart Rhodes II is facing trial alongside four other defendants: Jessica Watkins, Kelly Meggs, Kenneth Harrelson and Thomas Caldwell",
      "label": "neutral"
   },
   {
      "text": "Attorney Jeffrey Nestler told jurors",
      "label": "neutral"
   },
   {
      "text": "District Judge Amit Mehta told jurors they would begin deliberations at 9:30 a. m",
      "label": "neutral"
   },
   {
      "text": "If they weren’t going to, in my perspective, do the right thing, maybe they could be scared into doing the right thing",
      "label": "neutral"
   },
   {
      "text": "6 was that they should have brought rifle",
      "label": "neutral"
   },
   {
      "text": "6 in testimony before the jury in testimony that seemed to backfire",
      "label": "neutral"
   },
   {
      "text": "6, Thomas Caldwell claimed she really meant that there was a great opportunity for us to start the healing process in our country",
      "label": "neutral"
   },
   {
      "text": "6 did happen, Caldwell said on the stand, and I had nothing to do with it",
      "label": "neutral"
   },
   {
      "text": "Watkins was much more apologetic on the stand than Rhodes or Caldwell",
      "label": "neutral"
   },
   {
      "text": "I feel terrible about it in hindsight, she said but added that her actions were not premeditated",
      "label": "neutral"
   },
   {
      "text": "Watkins said what she did was really stupid and that she was just another idiot running around in the Capitol",
      "label": "neutral"
   },
   {
      "text": "The economy is at risk",
      "label": "neutral"
   },
   {
      "text": "It could extend the so-called cooling-off period, giving the parties more time to try to reach a voluntary agreement before workers can strike",
      "label": "neutral"
   },
   {
      "text": "I think it will pass, but it’s unfortunate this is how we’re running our economy today, McCarthy said",
      "label": "neutral"
   },
   {
      "text": "They aren’t going to have a choice, he said",
      "label": "neutral"
   },
   {
      "text": "This is not something where we have time to dither around with it",
      "label": "neutral"
   },
   {
      "text": "We need a solution now",
      "label": "neutral"
   },
   {
      "text": "This past week, Kanye West called me to have dinner at Mar-a-Lago",
      "label": "neutral"
   },
   {
      "text": "Shortly thereafter, he unexpectedly showed up with three of his friends, whom I knew nothing about, Trump said Friday in a statement on his Truth Social platform We had dinner on Tuesday evening with many members present on the back patio",
      "label": "neutral"
   },
   {
      "text": "The dinner was quick and uneventful, Trump said",
      "label": "neutral"
   },
   {
      "text": "They then left for the airport",
      "label": "neutral"
   }
]