{"Islamic State 'Beatles' cell member convicted in U.S. of beheading hostages": ["politics", "religion", "terrorism"], "Jihadists kill dozens across northern Togo": ["terrorism"], "Al-Shabab Attacks Key Bridges in Somalia, Kills at Least 21 People": ["politics", "religion", "terrorism"], "Liwa Fatemiyoun publishes a statement regarding the recent IS attack in Iran": ["politics", "terrorism"], "Pro-Iran Group Kills American English Teacher In Iraq": ["politics", "terrorism"], "Improvised Anti-Vehicle Land Mines (IAVMs) in Mexico: Cartel Emergent Weaponry Use": ["politics"], "Experts react: Al-Qaeda chief Ayman al-Zawahiri is dead. What’s next for US counterterrorism?": ["politics", "terrorism"], "wagner": ["neutral"], "Islamist militants in Mali kill hundreds, displace thousands in eastern advance": ["politics", "religion", "terrorism"], "Remote Warfare: Exploring the proliferation of targeted drone strikes": ["politics"], "AP sources: US operation killed al-Qaida leader al-Zawahri": ["politics", "terrorism"], "Russia threatens hundreds of thousands of people by mining dam, Zelenskyy warns": ["politics"], "US forces kill senior terrorist leader in Syria": ["politics", "terrorism"], "Suspected Suicide Bombers Strike in Northwest Syria": ["terrorism"], "Anonymous exposes Iranian regime support for key Al-Qaeda figures": ["politics", "terrorism"], "\"There is a pretty horrific video going around where a Russian soldier castrates a captured - live Ukrainian soldier. Not only is this real, it is far from an isolated incident. A source in the Ukrainian military has told me [this] has happened multiple times.\" - James Rushton (JimmySec)": ["politics", "terrorism"], "Justice Department stands up new domestic terrorism unit to target wave of violent extremists": ["terrorism"], "Al-Qaida Affiliate Claims Attack on Mali's Main Military Base": ["politics", "terrorism"], "Iran Is Once Again Using Its Civilian Airliners To Ferry Arms": ["politics"], "Islamic State Group Plot in Morocco Foiled With US Help": ["politics", "religion", "terrorism"], "Tajik terrorist serves as Taliban commander in northern Afghanistan": ["terrorism"], "Ukraine war: Body of captured British aid worker Paul Urey returned with signs of unspeakable torture, Kyiv says | UK News": ["politics", "terrorism"], "Active terror incident with hostages": ["terrorism"], "Decades Later, 9/11 Self-Professed Mastermind Awaits Trial": ["terrorism"], "ISIS planned chemical attacks in Europe, new details on weapons program reveal": ["politics", "terrorism"], "Why Russia’s War in Ukraine Is a Genocide": ["politics", "terrorism"], "Turkey detains 16 accused of links to Islamic State after bookshop clash": ["politics", "religion", "terrorism"], "Two Police, One Health Worker Shot Dead In Northwest Pakistan During Polio-Vaccination Drive": ["terrorism"], "Suicide Blast at Kabul School Kills 19": ["terrorism"], "Stoking Conflict by Keystroke": ["politics", "terrorism"], "UIA Flight PS752: Ukrainian Plane Shot Down Deliberately Say Parents of Victims": ["politics", "terrorism"], "Hafiz Saeed, wanted by U.S. after 2008 Mumbai bombings, sentenced to 31 years in prison": ["politics", "terrorism"], "Yemeni troops launch campaign against Al-Qaeda": ["politics", "terrorism"], "Benin Army Vehicle Strikes Land Mine as Security Fears in North Grow": ["politics", "terrorism"], "Dakar Rally Car Blast Caused by Improvised Explosive Device": ["terrorism"], "According to Yemen's foreign ministry, the Houthis should be classified as a terrorist group.": ["politics", "terrorism"], "Jihadist attacks flow into littoral West Africa": ["politics", "terrorism"], "Police Hunting for Man Who Left a Parcel Bomb at Toulouse Cathedral": ["religion", "terrorism"], "From Idlib to Madrid: How al-Qaeda nearly infiltrated the Spanish Government": ["politics", "religion", "terrorism"], "The Taliban’s unconvincing war on ISIS-K": ["politics", "religion", "terrorism"], "Understanding Boko Haram: An Interview with Jacob Zenn": ["terrorism"], "putin": ["neutral"], "The inside story of the CIA vs Russia": ["politics"], "Terrorists Benefit from Qatar’s Goodwill and Charity": ["politics", "terrorism"], "Zaporizhzhia nuclear power plant is currently occupied by terrorists and it's worse than you think": ["terrorism"], "Two Death-row Islamist Extremists Escape Bangladesh Court: were sentenced to death for killing a U.S. blogger critical of religious extremism": ["politics", "religion", "terrorism"], "Oslo mass shooting: 2 killed, 14 injured": ["terrorism"], "Terrorist Harpreet Singh, Accused In Ludhiana Court Blast Case, Arrested": ["terrorism"], "Brussels Police Officer Killed, Another Wounded in Stabbing Incident": ["politics", "terrorism"], "Oslo shooting: Norway attack being treated as Islamist terrorism, police say": ["politics", "religion", "terrorism"]}