{"Islamic State 'Beatles' cell member convicted in U.S. of beheading hostages": ["politics", "religion", "terrorism"], "Jihadists kill dozens across northern Togo": ["terrorism"], "Al-Shabab Attacks Key Bridges in Somalia, Kills at Least 21 People": ["politics", "religion", "terrorism"], "Liwa Fatemiyoun publishes a statement regarding the recent IS attack in Iran": ["politics", "terrorism"], "Pro-Iran Group Kills American English Teacher In Iraq": ["politics", "terrorism"], "Improvised Anti-Vehicle Land Mines (IAVMs) in Mexico: Cartel Emergent Weaponry Use": ["politics"], "Experts react: Al-Qaeda chief Ayman al-Zawahiri is dead. What’s next for US counterterrorism?": ["politics", "terrorism"], "wagner": ["neutral"], "Islamist militants in Mali kill hundreds, displace thousands in eastern advance": ["politics", "religion", "terrorism"], "Remote Warfare: Exploring the proliferation of targeted drone strikes": ["politics"], "AP sources: US operation killed al-Qaida leader al-Zawahri": ["politics", "terrorism"], "Russia threatens hundreds of thousands of people by mining dam, Zelenskyy warns": ["politics"], "US forces kill senior terrorist leader in Syria": ["politics", "terrorism"], "Suspected Suicide Bombers Strike in Northwest Syria": ["terrorism"], "Anonymous exposes Iranian regime support for key Al-Qaeda figures": ["politics", "terrorism"], "\"There is a pretty horrific video going around where a Russian soldier castrates a captured - live Ukrainian soldier. Not only is this real, it is far from an isolated incident. A source in the Ukrainian military has told me [this] has happened multiple times.\" - James Rushton (JimmySec)": ["politics", "terrorism"], "Justice Department stands up new domestic terrorism unit to target wave of violent extremists": ["terrorism"], "Al-Qaida Affiliate Claims Attack on Mali's Main Military Base": ["politics", "terrorism"], "Iran Is Once Again Using Its Civilian Airliners To Ferry Arms": ["politics"], "Islamic State Group Plot in Morocco Foiled With US Help": ["politics", "religion", "terrorism"], "Tajik terrorist serves as Taliban commander in northern Afghanistan": ["terrorism"], "Ukraine war: Body of captured British aid worker Paul Urey returned with signs of unspeakable torture, Kyiv says | UK News": ["politics", "terrorism"], "Active terror incident with hostages": ["terrorism"], "Decades Later, 9/11 Self-Professed Mastermind Awaits Trial": ["terrorism"], "ISIS planned chemical attacks in Europe, new details on weapons program reveal": ["politics", "terrorism"], "Why Russia’s War in Ukraine Is a Genocide": ["politics", "terrorism"], "Turkey detains 16 accused of links to Islamic State after bookshop clash": ["politics", "religion", "terrorism"], "Two Police, One Health Worker Shot Dead In Northwest Pakistan During Polio-Vaccination Drive": ["terrorism"], "Suicide Blast at Kabul School Kills 19": ["terrorism"], "Stoking Conflict by Keystroke": ["politics", "terrorism"], "UIA Flight PS752: Ukrainian Plane Shot Down Deliberately Say Parents of Victims": ["politics", "terrorism"], "Hafiz Saeed, wanted by U.S. after 2008 Mumbai bombings, sentenced to 31 years in prison": ["politics", "terrorism"], "Yemeni troops launch campaign against Al-Qaeda": ["politics", "terrorism"], "Benin Army Vehicle Strikes Land Mine as Security Fears in North Grow": ["politics", "terrorism"], "Dakar Rally Car Blast Caused by Improvised Explosive Device": ["terrorism"], "According to Yemen's foreign ministry, the Houthis should be classified as a terrorist group.": ["politics", "terrorism"], "Jihadist attacks flow into littoral West Africa": ["politics", "terrorism"], "Police Hunting for Man Who Left a Parcel Bomb at Toulouse Cathedral": ["religion", "terrorism"], "From Idlib to Madrid: How al-Qaeda nearly infiltrated the Spanish Government": ["politics", "religion", "terrorism"], "The Taliban’s unconvincing war on ISIS-K": ["politics", "religion", "terrorism"], "Understanding Boko Haram: An Interview with Jacob Zenn": ["terrorism"], "putin": ["neutral"], "The inside story of the CIA vs Russia": ["politics"], "Terrorists Benefit from Qatar’s Goodwill and Charity": ["politics", "terrorism"], "Zaporizhzhia nuclear power plant is currently occupied by terrorists and it's worse than you think": ["terrorism"], "Two Death-row Islamist Extremists Escape Bangladesh Court: were sentenced to death for killing a U.S. blogger critical of religious extremism": ["politics", "religion", "terrorism"], "Oslo mass shooting: 2 killed, 14 injured": ["terrorism"], "Terrorist Harpreet Singh, Accused In Ludhiana Court Blast Case, Arrested": ["terrorism"], "Brussels Police Officer Killed, Another Wounded in Stabbing Incident": ["politics", "terrorism"], "Oslo shooting: Norway attack being treated as Islamist terrorism, police say": ["politics", "religion", "terrorism"], "Tip by Belgian spy agency helped US foil Islamic State plot to kill George Bush": ["politics", "terrorism"], "Les talibans ont tiré d'énormes profits lors de la Coupe du monde au Qatar": ["politics", "terrorism"], "Six Niger Troops Killed in Attack Near Burkina Faso Border": ["politics", "terrorism"], "ISIS: From Near-State to Persistent Problem": ["politics", "religion", "terrorism"], "‘I will continue killing foreigners’: soldier who shot dead unarmed Australians treated as ‘returning hero’ by Taliban": ["politics", "terrorism"], "Islamic State Khurasan’s History of Targeting Diplomatic Missions": ["politics", "religion", "terrorism"], "Somalia's government spokesperson wounded in suicide bombing: al-Shabab extremist group has claimed responsibility": ["politics", "terrorism"], "British synagogue terrorist's family apologise to hostages and reveal they spoke with him during siege": ["terrorism"], "Iranian hackers use Log4Shell to mine crypto on federal computer system": ["politics"], "Examining Extremism: Harakat al Shabaab al Mujahideen (al Shabaab)": ["politics", "terrorism"], "BREAKING: Suspected explosive package found at US Embassy in Madrid": ["politics", "terrorism"], "The Islamic State Gains New Operational Foothold in Iraq’s Hamrin Mountains": ["politics", "religion", "terrorism"], "Terrorist Who Killed 2 at Gay Bar Inspired by Buffalo Shooter": ["terrorism"], "French Police Arrest Two People Suspected of Plotting Christmas Stabbing Attack": ["terrorism"], "Suspected Islamists kill seven in east Congo city of Beni": ["politics", "religion", "terrorism"], "Perspectives | Islamic State in Afghanistan seeks to recruit Uzbeks, Tajiks, Kyrgyz": ["politics", "religion", "terrorism"], "Iranian hackers release footage of Jerusalem attack from security camera": ["politics", "terrorism"], "American Woman Who Led ISIS Battalion Sentenced to 20 Years": ["politics", "religion", "terrorism"], "Israeli survivors remember Munich Olympic massacre, 50 years on": ["psychology", "terrorism"], "Attack In Northwest Pakistan Kills One Christian Priest, Leaves Another Injured": ["religion", "terrorism"], "Turkey's Syria policy at crossroads: Extremist HTS terror group captures Afrin Turkey's leaders are re-examining their Syria policy as new terrorist organizations take control of various regions.": ["politics", "terrorism"], "Ukraine war: Hundreds of graves found in liberated Izyum city - officials": ["politics", "terrorism"], "Zelensky labels Russian strike on shopping mall ‘terrorist attack’": ["politics", "terrorism"], "6 dead, dozens hospitalized in shooting along July Fourth parade route north of Chicago": ["terrorism"], "Bali bomber released after serving just half sentence: Islamic militant Umar Patek granted early release weeks before 20th anniversary of terror attack that killed 202 mostly Australian tourists": ["politics", "religion", "terrorism"], "Bomb Kills Two Peacekeepers in Mali, UN Says": ["terrorism"], "Exclusive: Trump Raid Documents Could Reveal Informants on U.S. Payroll": ["politics"], "Al Qaeda ideologue calls for jihad in Sudan, provides guidelines": ["politics", "terrorism"], "The U.S. Must Better Explain Al-Qaeda to the Public: The government is doing too little to inform Americans about the threats presented by suspected terrorists it is targeting.": ["politics", "terrorism"], "US Intelligence Predicted Resurgence of Islamic State Group Threat, Declassified Report Shows": ["politics", "religion", "terrorism"], "A summer of bomb threats frightens Moldova as war rages nearby | News": ["politics", "terrorism"], "Over 30 Militants, Two Soldiers Killed in Insurgent (Islamic State linked) Clash in Mozambique": ["politics", "religion", "terrorism"], "Boko Haram fighters kill 10 Chadian soldiers near Nigeria border": ["politics", "terrorism"], "Tunisia Thwarts Alleged Terrorist Attack Targeting Tourist Areas": ["politics", "terrorism"], "Islamic State launches new Tajik propaganda network": ["politics", "religion", "terrorism"], "At least 13 killed in northern Syria bus attack": ["terrorism"], "‘Rampant violence’ in Syrian camp for ISIL-linked detainees: MSF | ISIL/ISIS News": ["politics", "religion", "terrorism"], "7,000 Refugees Cross from Burkina Faso to Ivory Coast as Violence Spreads": ["politics", "terrorism"], "Suicide Car Bomb Blast Targets Somali Regional Capital": ["politics", "terrorism"], "Tajik Islamic State network fundraises in Russia": ["politics", "religion", "terrorism"], "At Least 6 Killed, 10 Wounded in Twin Attacks in Niger": ["terrorism"], "Label Putin’s Russia a ‘terrorist state’ - The designation would have dramatic legal consequences for the war in Ukraine, and it’s time for the world to act.": ["politics", "terrorism"], "IS Mozambique demands Christians and Jews convert or pay tax to Islamic State": ["politics", "religion", "terrorism"], "Norway: Gunman Kills 2 During Oslo Pride Festival; Terror Suspected": ["terrorism"], "Abducted 16-year-old was forced to clean up after Russian invaders' torture of Ukrainian POWs and hostages": ["politics", "psychology", "terrorism"], "Islamic State’s Shiraz Attack Provokes Narrative War with Iran and al-Qaeda": ["politics", "religion", "terrorism"], "Hezbollah transporting hundreds of chemical weapons to Lebanon": ["politics", "terrorism"], "After Syria raid, U.S. kills Islamic State militants in air strike": ["politics", "religion", "terrorism"], "Yazidis Laud France, Sweden for Launching Joint Probe to Prosecute IS Fighters": ["politics", "terrorism"], "High-ranking Russian officials openly incite to genocide against Ukraine": ["politics", "terrorism"], "The Russian Federation’s Acts of Nuclear Terrorism Must Be Stopped": ["politics", "terrorism"], "Afghan Taliban turn blind eye to Pakistani militants": ["politics", "terrorism"], "“All-Out War”: Somalia’s Renewed Offensive Against al-Shabaab": ["politics", "terrorism"], "India: Muslim Group PFI Disbands After Government Ban": ["politics", "religion", "terrorism"], "Indonesia Considers Objection to Bali Bomber’s Early Release": ["politics", "terrorism"], "Terror in Paradise: The Islamic State’s Enduring Presence in Mozambique": ["politics", "religion", "terrorism"], "Turkey’s concerns about PKK are not legitimate": ["politics", "terrorism"], "Philippine Militants Accused of Beheading Tourists Surrender": ["politics", "terrorism"], "Afghanistan: gunmen storm Sikh temple in Kabul: At least one person killed and seven wounded": ["religion", "terrorism"], "Life sentence for ISIS ‘Beatle’ who tortured, ransomed U.S. hostages": ["politics", "religion", "terrorism"], "Azov": ["neutral"], "Suicide Blast Hits Pakistan Police Truck on Way to Protect Polio Workers": ["politics", "terrorism"], "Jihadis Kill 11 in Burkina Faso Ambush, Security Sources Say": ["politics", "religion", "terrorism"], "What’s Old Is New Again: Cold War Lessons for Countering Disinformation - Texas National Security Review": ["politics"], "Governor Abbott Designates Mexican Cartels As Terrorist Organizations": ["politics", "terrorism"], "US Doubles Reward for 3 al-Shabab Leaders to $10 Million": ["politics", "terrorism"], "Al-Qaida enjoying a haven in Afghanistan under Taliban, UN warns": ["politics", "terrorism"], "San Pedro Train Engineer Pleads Guilty to Terrorism Charge for Intentionally Derailing Locomotive Near U.S. Navy Hospital Ship": ["politics", "terrorism"], "2 Police Officers Killed in North Benin Attack": ["politics", "terrorism"], "West African Countries Meet Over Spillover of Terrorism From Sahel Region": ["politics", "terrorism"], "Over 100 ex-Afghan forces, officials killed since US pullout: UN": ["politics", "terrorism"], "At Least One Dead In Blast At Mosque In Afghanistan": ["terrorism"], "Exclusive: Iran is seeking Russia's help to bolster its nuclear program, US intel officials believe": ["politics", "terrorism"], "At Least 20 Killed in Triple Car Bombings in Central Somalia": ["terrorism"], "Several Americans wounded in Jerusalem terror attack": ["politics", "terrorism"], "56% rise in terror attacks in Pakistan during 2021": ["terrorism"], "Eight Pakistani Soldiers Injured In Suicide Attack In North Waziristan": ["politics", "terrorism"], "Over 50 Feared Dead in Nigeria Church Attack, Officials Say": ["religion", "terrorism"], "French army kills key IS group suspect in 2020 murders of Niger aid workers": ["politics", "religion", "terrorism"], "Stalked, tortured, disappeared: Iranian authorities have a playbook for silencing dissent, and they're using it again | CNN": ["politics", "psychology", "terrorism"], "U.S. Releases Gitmo Detainee After 15 Years – Court Rules He Was Detained “Unlawfully” without Trial": ["politics"], "Islamic State threatens Central Asian and Chinese ventures in Afghanistan": ["politics", "religion", "terrorism"], "Al-Shabab Militants Storm Mogadishu Hotel": ["terrorism"], "Iraq: How life under Islamic State impacted Mosul's deaf community": ["politics", "religion", "terrorism"], "Pilot circling US city threatens to crash on Walmart": ["politics", "terrorism"], "The Online Dissemination of Ideological Books on Pro-Al-Qaeda Channels": ["politics", "terrorism"], "Car bomb in Somali capital kills eight - ambulance services director": ["terrorism"], "UAE intercepts Houthi missle attack as Israeli president visits": ["politics", "terrorism"], "Canadian police charge man with terrorism over alleged plot to overthrow Haitian government": ["politics", "terrorism"], "Islamic State 'Beatle' Case Goes to Jury in Virginia": ["politics", "religion", "terrorism"], "Pakistan Taken off Global Watchdog's 'Grey' List for Terrorism Financing": ["politics", "terrorism"], "HTS carried out a rare Inghimasi raid on SAA positions near Khirbet Jadraya, Western Aleppo": ["politics", "terrorism"], "UN Raises Kabul Classroom Bombing Death Toll to 35 as Women Protest 'Genocide'": ["politics", "terrorism"], "Pakistan warns Afghanistan's Taliban not to shelter militants": ["politics", "terrorism"], "Three UN Peacekeepers Killed, Three Injured in Mali Attack": ["politics", "terrorism"], "Once Upon a Time in Iraq (full documentary) | FRONTLINE": ["neutral"], "strike": ["neutral"]}