{"Islamic State 'Beatles' cell member convicted in U.S. of beheading hostages": ["politics", "religion", "terrorism"], "Jihadists kill dozens across northern Togo": ["religion", "terrorism"], "Al-Shabab Attacks Key Bridges in Somalia, Kills at Least 21 People": ["politics", "religion", "terrorism"], "Liwa Fatemiyoun publishes a statement regarding the recent IS attack in Iran": ["politics", "terrorism"], "Pro-Iran Group Kills American English Teacher In Iraq": ["politics", "terrorism"], "Improvised Anti-Vehicle Land Mines (IAVMs) in Mexico: Cartel Emergent Weaponry Use": ["politics"], "Experts react: Al-Qaeda chief Ayman al-Zawahiri is dead. What’s next for US counterterrorism?": ["politics", "religion", "terrorism"], "wagner": ["politics", "terrorism"], "Islamist militants in Mali kill hundreds, displace thousands in eastern advance": ["politics", "religion", "terrorism"], "Remote Warfare: Exploring the proliferation of targeted drone strikes": ["politics"], "AP sources: US operation killed al-Qaida leader al-Zawahri": ["politics", "terrorism"], "Russia threatens hundreds of thousands of people by mining dam, Zelenskyy warns": ["politics"], "US forces kill senior terrorist leader in Syria": ["politics", "terrorism"], "Suspected Suicide Bombers Strike in Northwest Syria": ["terrorism"], "Anonymous exposes Iranian regime support for key Al-Qaeda figures": ["politics", "religion", "terrorism"], "\"There is a pretty horrific video going around where a Russian soldier castrates a captured - live Ukrainian soldier. Not only is this real, it is far from an isolated incident. A source in the Ukrainian military has told me [this] has happened multiple times.\" - James Rushton (JimmySec)": ["politics", "terrorism"], "Justice Department stands up new domestic terrorism unit to target wave of violent extremists": ["terrorism"], "Al-Qaida Affiliate Claims Attack on Mali's Main Military Base": ["politics", "terrorism"], "Iran Is Once Again Using Its Civilian Airliners To Ferry Arms": ["politics"], "Islamic State Group Plot in Morocco Foiled With US Help": ["politics", "religion", "terrorism"], "Tajik terrorist serves as Taliban commander in northern Afghanistan": ["religion", "terrorism"], "Ukraine war: Body of captured British aid worker Paul Urey returned with signs of unspeakable torture, Kyiv says | UK News": ["politics", "terrorism"], "Active terror incident with hostages": ["terrorism"], "Decades Later, 9/11 Self-Professed Mastermind Awaits Trial": ["terrorism"], "ISIS planned chemical attacks in Europe, new details on weapons program reveal": ["politics", "terrorism"], "Why Russia’s War in Ukraine Is a Genocide": ["politics", "terrorism"], "Turkey detains 16 accused of links to Islamic State after bookshop clash": ["politics", "religion", "terrorism"], "Two Police, One Health Worker Shot Dead In Northwest Pakistan During Polio-Vaccination Drive": ["terrorism"], "Suicide Blast at Kabul School Kills 19": ["terrorism"], "Stoking Conflict by Keystroke": ["politics", "terrorism"], "UIA Flight PS752: Ukrainian Plane Shot Down Deliberately Say Parents of Victims": ["politics", "terrorism"], "Hafiz Saeed, wanted by U.S. after 2008 Mumbai bombings, sentenced to 31 years in prison": ["politics", "terrorism"], "Yemeni troops launch campaign against Al-Qaeda": ["politics", "religion", "terrorism"], "Benin Army Vehicle Strikes Land Mine as Security Fears in North Grow": ["politics", "terrorism"], "Dakar Rally Car Blast Caused by Improvised Explosive Device": ["terrorism"], "According to Yemen's foreign ministry, the Houthis should be classified as a terrorist group.": ["politics", "terrorism"], "Jihadist attacks flow into littoral West Africa": ["politics", "religion", "terrorism"], "Police Hunting for Man Who Left a Parcel Bomb at Toulouse Cathedral": ["religion", "terrorism"], "From Idlib to Madrid: How al-Qaeda nearly infiltrated the Spanish Government": ["politics", "religion", "terrorism"], "The Taliban’s unconvincing war on ISIS-K": ["politics", "religion", "terrorism"], "Understanding Boko Haram: An Interview with Jacob Zenn": ["religion", "terrorism"], "putin": ["politics"], "The inside story of the CIA vs Russia": ["politics"], "Terrorists Benefit from Qatar’s Goodwill and Charity": ["politics", "terrorism"], "Zaporizhzhia nuclear power plant is currently occupied by terrorists and it's worse than you think": ["politics", "terrorism"], "Two Death-row Islamist Extremists Escape Bangladesh Court: were sentenced to death for killing a U.S. blogger critical of religious extremism": ["politics", "religion", "terrorism"], "Oslo mass shooting: 2 killed, 14 injured": ["terrorism"], "Terrorist Harpreet Singh, Accused In Ludhiana Court Blast Case, Arrested": ["terrorism"], "Brussels Police Officer Killed, Another Wounded in Stabbing Incident": ["politics", "terrorism"], "Oslo shooting: Norway attack being treated as Islamist terrorism, police say": ["politics", "religion", "terrorism"], "Tip by Belgian spy agency helped US foil Islamic State plot to kill George Bush": ["politics", "terrorism"], "Les talibans ont tiré d'énormes profits lors de la Coupe du monde au Qatar": ["politics", "religion", "terrorism"], "Six Niger Troops Killed in Attack Near Burkina Faso Border": ["politics", "terrorism"], "ISIS: From Near-State to Persistent Problem": ["politics", "religion", "terrorism"], "‘I will continue killing foreigners’: soldier who shot dead unarmed Australians treated as ‘returning hero’ by Taliban": ["politics", "religion", "terrorism"], "Islamic State Khurasan’s History of Targeting Diplomatic Missions": ["politics", "religion", "terrorism"], "Somalia's government spokesperson wounded in suicide bombing: al-Shabab extremist group has claimed responsibility": ["politics", "religion", "terrorism"], "British synagogue terrorist's family apologise to hostages and reveal they spoke with him during siege": ["terrorism"], "Iranian hackers use Log4Shell to mine crypto on federal computer system": ["politics"], "Examining Extremism: Harakat al Shabaab al Mujahideen (al Shabaab)": ["politics", "religion", "terrorism"], "BREAKING: Suspected explosive package found at US Embassy in Madrid": ["politics", "terrorism"], "The Islamic State Gains New Operational Foothold in Iraq’s Hamrin Mountains": ["politics", "religion", "terrorism"], "Terrorist Who Killed 2 at Gay Bar Inspired by Buffalo Shooter": ["terrorism"], "French Police Arrest Two People Suspected of Plotting Christmas Stabbing Attack": ["terrorism"], "Suspected Islamists kill seven in east Congo city of Beni": ["politics", "religion", "terrorism"], "Perspectives | Islamic State in Afghanistan seeks to recruit Uzbeks, Tajiks, Kyrgyz": ["politics", "religion", "terrorism"], "Iranian hackers release footage of Jerusalem attack from security camera": ["politics", "terrorism"], "American Woman Who Led ISIS Battalion Sentenced to 20 Years": ["politics", "religion", "terrorism"], "Israeli survivors remember Munich Olympic massacre, 50 years on": ["psychology", "terrorism"], "Attack In Northwest Pakistan Kills One Christian Priest, Leaves Another Injured": ["religion", "terrorism"], "Turkey's Syria policy at crossroads: Extremist HTS terror group captures Afrin Turkey's leaders are re-examining their Syria policy as new terrorist organizations take control of various regions.": ["politics", "terrorism"], "Ukraine war: Hundreds of graves found in liberated Izyum city - officials": ["politics", "terrorism"], "Zelensky labels Russian strike on shopping mall ‘terrorist attack’": ["politics", "terrorism"], "6 dead, dozens hospitalized in shooting along July Fourth parade route north of Chicago": ["terrorism"], "Bali bomber released after serving just half sentence: Islamic militant Umar Patek granted early release weeks before 20th anniversary of terror attack that killed 202 mostly Australian tourists": ["politics", "religion", "terrorism"], "Bomb Kills Two Peacekeepers in Mali, UN Says": ["terrorism"], "Exclusive: Trump Raid Documents Could Reveal Informants on U.S. Payroll": ["politics"], "Al Qaeda ideologue calls for jihad in Sudan, provides guidelines": ["politics", "religion", "terrorism"], "The U.S. Must Better Explain Al-Qaeda to the Public: The government is doing too little to inform Americans about the threats presented by suspected terrorists it is targeting.": ["politics", "religion", "terrorism"], "US Intelligence Predicted Resurgence of Islamic State Group Threat, Declassified Report Shows": ["politics", "religion", "terrorism"], "A summer of bomb threats frightens Moldova as war rages nearby | News": ["politics", "terrorism"], "Over 30 Militants, Two Soldiers Killed in Insurgent (Islamic State linked) Clash in Mozambique": ["politics", "religion", "terrorism"], "Boko Haram fighters kill 10 Chadian soldiers near Nigeria border": ["politics", "religion", "terrorism"], "Tunisia Thwarts Alleged Terrorist Attack Targeting Tourist Areas": ["politics", "terrorism"], "Islamic State launches new Tajik propaganda network": ["politics", "religion", "terrorism"], "At least 13 killed in northern Syria bus attack": ["terrorism"], "‘Rampant violence’ in Syrian camp for ISIL-linked detainees: MSF | ISIL/ISIS News": ["politics", "religion", "terrorism"], "7,000 Refugees Cross from Burkina Faso to Ivory Coast as Violence Spreads": ["politics", "terrorism"], "Suicide Car Bomb Blast Targets Somali Regional Capital": ["politics", "terrorism"], "Tajik Islamic State network fundraises in Russia": ["politics", "religion", "terrorism"], "At Least 6 Killed, 10 Wounded in Twin Attacks in Niger": ["terrorism"], "Label Putin’s Russia a ‘terrorist state’ - The designation would have dramatic legal consequences for the war in Ukraine, and it’s time for the world to act.": ["politics", "terrorism"], "IS Mozambique demands Christians and Jews convert or pay tax to Islamic State": ["politics", "religion", "terrorism"], "Norway: Gunman Kills 2 During Oslo Pride Festival; Terror Suspected": ["terrorism"], "Abducted 16-year-old was forced to clean up after Russian invaders' torture of Ukrainian POWs and hostages": ["politics", "psychology", "terrorism"], "Islamic State’s Shiraz Attack Provokes Narrative War with Iran and al-Qaeda": ["politics", "religion", "terrorism"], "Hezbollah transporting hundreds of chemical weapons to Lebanon": ["politics", "religion", "terrorism"], "After Syria raid, U.S. kills Islamic State militants in air strike": ["politics", "religion", "terrorism"], "Yazidis Laud France, Sweden for Launching Joint Probe to Prosecute IS Fighters": ["politics", "religion", "terrorism"], "High-ranking Russian officials openly incite to genocide against Ukraine": ["politics", "terrorism"], "The Russian Federation’s Acts of Nuclear Terrorism Must Be Stopped": ["politics", "terrorism"], "Afghan Taliban turn blind eye to Pakistani militants": ["politics", "religion", "terrorism"], "“All-Out War”: Somalia’s Renewed Offensive Against al-Shabaab": ["politics", "terrorism"], "India: Muslim Group PFI Disbands After Government Ban": ["politics", "religion", "terrorism"], "Indonesia Considers Objection to Bali Bomber’s Early Release": ["politics", "terrorism"], "Terror in Paradise: The Islamic State’s Enduring Presence in Mozambique": ["politics", "religion", "terrorism"], "Turkey’s concerns about PKK are not legitimate": ["politics", "terrorism"], "Philippine Militants Accused of Beheading Tourists Surrender": ["politics", "terrorism"], "Afghanistan: gunmen storm Sikh temple in Kabul: At least one person killed and seven wounded": ["religion", "terrorism"], "Life sentence for ISIS ‘Beatle’ who tortured, ransomed U.S. hostages": ["politics", "religion", "terrorism"], "Azov": ["politics", "terrorism"], "Suicide Blast Hits Pakistan Police Truck on Way to Protect Polio Workers": ["politics", "terrorism"], "Jihadis Kill 11 in Burkina Faso Ambush, Security Sources Say": ["politics", "religion", "terrorism"], "What’s Old Is New Again: Cold War Lessons for Countering Disinformation - Texas National Security Review": ["politics"], "Governor Abbott Designates Mexican Cartels As Terrorist Organizations": ["politics", "terrorism"], "US Doubles Reward for 3 al-Shabab Leaders to $10 Million": ["politics", "religion", "terrorism"], "Al-Qaida enjoying a haven in Afghanistan under Taliban, UN warns": ["politics", "religion", "terrorism"], "San Pedro Train Engineer Pleads Guilty to Terrorism Charge for Intentionally Derailing Locomotive Near U.S. Navy Hospital Ship": ["politics", "terrorism"], "2 Police Officers Killed in North Benin Attack": ["politics", "terrorism"], "West African Countries Meet Over Spillover of Terrorism From Sahel Region": ["politics", "terrorism"], "Over 100 ex-Afghan forces, officials killed since US pullout: UN": ["politics", "terrorism"], "At Least One Dead In Blast At Mosque In Afghanistan": ["terrorism"], "Exclusive: Iran is seeking Russia's help to bolster its nuclear program, US intel officials believe": ["politics", "terrorism"], "At Least 20 Killed in Triple Car Bombings in Central Somalia": ["terrorism"], "Several Americans wounded in Jerusalem terror attack": ["politics", "terrorism"], "56% rise in terror attacks in Pakistan during 2021": ["terrorism"], "Eight Pakistani Soldiers Injured In Suicide Attack In North Waziristan": ["politics", "terrorism"], "Over 50 Feared Dead in Nigeria Church Attack, Officials Say": ["religion", "terrorism"], "French army kills key IS group suspect in 2020 murders of Niger aid workers": ["politics", "religion", "terrorism"], "Stalked, tortured, disappeared: Iranian authorities have a playbook for silencing dissent, and they're using it again | CNN": ["politics", "psychology", "terrorism"], "U.S. Releases Gitmo Detainee After 15 Years – Court Rules He Was Detained “Unlawfully” without Trial": ["politics"], "Islamic State threatens Central Asian and Chinese ventures in Afghanistan": ["politics", "religion", "terrorism"], "Al-Shabab Militants Storm Mogadishu Hotel": ["religion", "terrorism"], "Iraq: How life under Islamic State impacted Mosul's deaf community": ["politics", "religion", "terrorism"], "Pilot circling US city threatens to crash on Walmart": ["politics", "terrorism"], "The Online Dissemination of Ideological Books on Pro-Al-Qaeda Channels": ["politics", "religion", "terrorism"], "Car bomb in Somali capital kills eight - ambulance services director": ["terrorism"], "UAE intercepts Houthi missle attack as Israeli president visits": ["politics", "terrorism"], "Canadian police charge man with terrorism over alleged plot to overthrow Haitian government": ["politics", "terrorism"], "Islamic State 'Beatle' Case Goes to Jury in Virginia": ["politics", "religion", "terrorism"], "Pakistan Taken off Global Watchdog's 'Grey' List for Terrorism Financing": ["politics", "terrorism"], "HTS carried out a rare Inghimasi raid on SAA positions near Khirbet Jadraya, Western Aleppo": ["politics", "terrorism"], "UN Raises Kabul Classroom Bombing Death Toll to 35 as Women Protest 'Genocide'": ["politics", "terrorism"], "Pakistan warns Afghanistan's Taliban not to shelter militants": ["politics", "religion", "terrorism"], "Three UN Peacekeepers Killed, Three Injured in Mali Attack": ["politics", "terrorism"], "Once Upon a Time in Iraq (full documentary) | FRONTLINE": ["politics"], "strike": ["neutral"], "Suspected Jihadis Kill Troops, Civilians in Nigeria": ["politics", "religion", "terrorism"], "How to get on a Watchlist Episode 6: How to join an extremist group": ["politics", "terrorism"], "Al-Houthi on the terrorism list due to threats to oil sites and affecting the prices of the international market of the entire country.": ["politics", "terrorism"], "New Mexico Man Accused of Planning Islamic State Training Center": ["politics", "religion", "terrorism"], "Gunmen Kill 2 Policemen Escorting Polio Workers in Pakistan": ["politics", "terrorism"], "[Opinion] How to react when an EU-applicant is suspected of using chemical weapons?": ["politics", "terrorism"], "Why buses remain a prime target for terrorist attacks": ["terrorism"], "The secret behind al-Shabaab’s longevity: A formidable spy wing": ["politics", "terrorism"], "Rushdie and the Satanic Clerics of Iran": ["politics", "psychology", "religion", "terrorism"], "Chinese Transplant Surgeons Executed Prisoners By Heart Extraction, New Study Finds": ["psychology", "terrorism"], "Making Sense of the Islamic State’s War on the Afghan Taliban": ["politics", "religion", "terrorism"], "US hits Iran with fresh sanctions following Albania cyberattack": ["politics"], "Analysis of the Islamic State’s prison break in the Congo": ["politics", "religion", "terrorism"], "Video of Child Militants Executing Nigerian Soldiers Raises Concerns (Islamic State West Africa Province (ISWAP))": ["politics", "psychology", "religion", "terrorism"], "Gunmen kill 15 Nigerian soldiers in attack on base, sources say": ["politics", "terrorism"], "Cop killed in central Israel ramming by Palestinian teen driving stolen car": ["politics", "terrorism"], "Suspected Islamist Militants Kill 132 Civilians in Central Mali": ["politics", "religion", "terrorism"], "Taliban-led Supreme Court says 19 people lashed in northeastern Afghanistan": ["politics", "religion", "terrorism"], "Feds: Texas Man Vowed to Kill Migrants, Jews, Black People, Beto O'Rourke Supporters and Cops": ["politics", "psychology", "religion", "terrorism"], "Killings by Islamist Militia in the DRC Rose Almost 50% in 2021, UN Says": ["politics", "religion", "terrorism"], "New book about international volunteers in the YPG and the war against ISIS": ["politics", "terrorism"], "Ukraine says arrests Russian agent planning attacks in Odessa": ["politics", "terrorism"], "Russia Tortured Workers at Zaporizhzhia Nuclear Power Plant": ["politics", "terrorism"], "Philippine forces report killing Daesh ‘spokesperson’": ["politics", "religion", "terrorism"], "The final call of the British-Pakistani, Texas synagogue terrorist to his brother": ["politics", "religion", "terrorism"], "14 Killed As Violence Surges in Burkina Faso": ["terrorism"], "Iranian IRGC member charged for plot to kill John Bolton": ["politics", "terrorism"], "5 Surprising Facts About the 1983 Beirut Barracks Bombing": ["terrorism"], "Officials Say Insurgency in Northern Mozambique Is Spreading": ["terrorism"], "Gunmen Kill Police Officer Guarding Polio Vaccination Team (Pakistan)": ["politics", "terrorism"], "Estonia declares Russia a terrorist state, biggest danger to world peace": ["politics", "terrorism"], "Eight Killed In Roadside Bomb In Northwest Pakistan Claimed By Tehrik-e Taliban": ["religion", "terrorism"], "More Than 20 Dead in Terrorists’ Siege of Mogadishu Hotel: Al Qaeda-affiliated militants claimed responsibility for attack on Hayat Hotel in Somalia’s capital": ["politics", "religion", "terrorism"], "Suicide bomber behind Afghanistan massacre of US troops identified": ["politics", "terrorism"], "Israeli-owned tanker hit by Iran drone series Russia uses in Ukraine -US": ["politics", "terrorism"], "Why is there a Chinese police outpost on Dublin’s Capel Street? | 25SEP22": ["politics"], "Al-Qaeda imprint in Assam: 12 jihadis, including Madarsa teacher, linked to Bangladeshi terror group arrested": ["politics", "religion", "terrorism"], "At Least 30 Burundian AU Soldiers Killed in Al-Shabab Attack, Official Says": ["politics", "religion", "terrorism"], "In the shadow of war, Kremlin continues terrorizing Crimean Tatars | 12OCT22": ["politics", "terrorism"], "Islamic State recruiting Uzbeks to fight in Afghanistan": ["politics", "religion", "terrorism"], "Too Risky to Bring Home Islamic State Wives, Widows Say Australian Opposition Lawmakers": ["politics", "religion", "terrorism"], "More Than a Bicycle Brake on a Missile: AI Ethics in Defense - War on the Rocks": ["politics"], "Bidens to Commemorate 9/11 Anniversary at Pentagon, Pennsylvania": ["politics", "terrorism"], "Pakistani TV Journalist Shot Dead In Lahore": ["politics", "terrorism"], "Militant Ambush, Gunfight Kill 8 Pakistan Security Forces": ["politics", "terrorism"], "Militants kill 15 in attack on Burkina Faso military supply mission - army": ["politics", "terrorism"], "Five rangers, soldier killed in attack in Benin, park management says": ["politics", "terrorism"], "Suspected (ISIS) bomb maker on trial in Morocco after U.S. help arrest him, police say": ["politics", "religion", "terrorism"], "Four People Killed In Attack Targeting Lawmaker In Pakistan": ["politics", "terrorism"], "Afghanistan: Kabul blasts kill six and wound 20 at boys' school": ["terrorism"], "Opinion | Russia Traffics in Ukrainian Children": ["politics"], "Tortured to death by Russia's FSB for helping to defend Ukraine from the invaders": ["politics", "terrorism"], "Polish Senate unanimously declares Russian government as terrorist regime": ["politics", "terrorism"], "Insurgents Attack Military Base in Mali": ["politics", "terrorism"], "ISKP claimed the group targeted Uzbek forces in Termez with 10 Katyusha rockets": ["politics", "religion", "terrorism"], "At least eight killed in suspected Al-Qaeda attack in Yemen": ["politics", "religion", "terrorism"], "Car bomb kills one, hurts nearly 30 in southern Thailand": ["terrorism"], "U.N. Proposing Paying Nearly $6 Million to Taliban for Security": ["politics", "religion", "terrorism"], "The Islamic State": ["religion", "terrorism"], "Pakistan Market Bombing Kills 2, Injures at Least 29": ["terrorism"], "Pakistan Sends Secret Delegation To Afghanistan In Bid To Revive Peace Talks With TTP": ["politics"], "OIG Says DHS Could Do More to Fight Domestic Terrorism": ["politics", "terrorism"], "US military announces killing of senior al-Qaeda leader in drone strike": ["politics", "religion", "terrorism"], "42 Malian Soldiers Killed in Suspected Jihadi Attacks": ["politics", "religion", "terrorism"], "US calls for Eritrea to withdraw soldiers in Tigray, Ethiopia |": ["politics"], "Police Say 21 Killed In Kabul Mosque Blast": ["politics", "terrorism"], "Police: Four Hurt in Bomb Blast in Busy Market in East Congo": ["terrorism"], "Al Qaeda branch claims attack on Burkina Faso convoy that killed over a dozen": ["politics", "religion", "terrorism"], "Russia accuses Kyiv of poisoning some of its soldiers in Ukraine": ["politics", "terrorism"], "Back to the Past: How Taliban Rule Has Wiped Out Afghanistan’s Gains and Provided Haven for Terrorists": ["politics", "religion", "terrorism"], "The shadowy economics of ISIS resurgence in Syria": ["politics", "religion", "terrorism"], "Turkistan Islamic Party Renews Focus on Anti-China Jihad, Calls for Liberation of Homeland from “Chinese Invaders”": ["politics", "religion", "terrorism"], "Afghanistan: Russian embassy staff killed in Kabul bombing": ["politics", "terrorism"], "Suicide bomber hits Russian Embassy in Kabul, killing top diplomat": ["politics", "terrorism"], "Six Soldiers Wounded In Suicide Attack In Northwestern Pakistan": ["politics", "terrorism"], "Hamas, other terrorist groups, praise Jerusalem bombing attack": ["terrorism"], "Stabbing terror attack victim dies 2 weeks later, ID'd as Shalom Sofer (West Bank)": ["terrorism"], "U.S. forces coordinate with Somalia to conduct airstrike against al-Shabab terrorists": ["politics", "religion", "terrorism"], "Italian police have arrested a Pakistani citizen who allegedly glorified jihadist groups such as the Tehrik-i-Taliban Pakistan (TTP) and incited violence on social networks, in Urdu. The man, 31, was waiting for the enforcement of a deportation order.": ["politics", "religion", "terrorism"], "Islamic State gunmen in Iraq kill 11 soldiers in brazen barracks attack": ["politics", "religion", "terrorism"], "U.S. senators introduce bill to designate Russia state sponsor of terrorism": ["politics", "terrorism"], "WSJ News Exclusive | Saudi Arabia, U.S. on High Alert After Warning of Imminent Iranian Attack": ["politics", "terrorism"], "Canada police arrest Syria returnee on terrorism-related charges": ["politics", "terrorism"], "How the C.I.A. Tracked the Leader of Al Qaeda: The U.S. search for Ayman al-Zawahri had spanned decades. His presence on a balcony at a safe house in Kabul presented an opportunity to strike.": ["politics", "religion", "terrorism"], "Russia planned to attack Japan in 2021: leaked FSB letters": ["politics", "terrorism"], "Syria’s al-Hol a ‘breeding ground’ for next generation of ISIS, CENTCOM chief warns": ["politics", "religion", "terrorism"], "Life in the sand: Exclusive interview with an ISIS Syrian desert Commander": ["politics", "religion", "terrorism"], "Request for Input - Concept of Taqiyya": ["politics", "terrorism"], "Islamic State Claims Responsibility for Shrine Attack in Iran (13 Killed)": ["politics", "religion", "terrorism"], "Druze warn they will enter Jenin if kidnapped teen not returned": ["politics", "terrorism"], "How is cryptocurrency funding terrorism across the globe": ["politics", "terrorism"], "US Sanctions South African Islamic State-Affiliated Firms": ["politics", "religion", "terrorism"], "Al-Qaida Positioned to Surpass Islamic State Among Jihadis": ["politics", "religion", "terrorism"], "At least six dead in suspected terrorist bombing in Istanbul, Turkey": ["terrorism"], "Russian troops raped and tortured children in Ukraine, U.N. panel says": ["politics", "psychology", "terrorism"], "Western governments &amp; defence contractors support Turkey &amp; its Jihadi proxies who are committing war crimes in Syria": ["politics", "religion", "terrorism"], "Second person dies of injuries days after Jerusalem bombing attack": ["terrorism"], "At Least 7 Dead in Somalia After Al-Shabab Attacks": ["religion", "terrorism"], "Al-Shabab Fighters Kill Crew Drilling Well in Southern Somalia": ["politics", "religion", "terrorism"], "Car Bomb Targeting Somalia Election Delegates Kills Six": ["politics", "terrorism"], "Iran tried to assassinate British residents 10 times this year, MI5 reveals": ["politics", "terrorism"], "Pakistan Taliban Announce Resumption of Nationwide Terror Attacks": ["politics", "religion", "terrorism"], "Assessing the Islamic State’s Recent Prison Break in Nigeria": ["religion", "terrorism"], "Saudi Arabian Grand Prix going ahead despite rebel attack": ["politics", "religion", "terrorism"], "John Kiriakou | Ex -CIA whistleblower | #44 Homeless Romantic Podcast": ["neutral"], "Nigeria: Insurgency Destroys 497 Classrooms, Leaves 2.8m Learners in Need of Support, Says Minister": ["politics", "terrorism"], "Ayman al Zawahiri is alive; Taliban and Al Qaeda “remain close,” UN reports": ["politics", "religion", "terrorism"], "Kurdish forces end 3-month operation against ISIS supporters in Syria’s al-Hol camp": ["politics", "religion", "terrorism"], "Watchdog accuses Palestinian Authority, Hamas of routinely torturing detainees": ["politics", "terrorism"], "Burkina Faso 'Fighting for Survival' Against Jihadists": ["politics", "religion", "terrorism"], "US and UK warn of possible attack in Nigeria's capital": ["politics", "terrorism"], "Canadian Sentenced to 20 Years in US Prison for Aiding IS": ["politics", "religion", "terrorism"], "Deadly suicide bomb attack at bar in eastern DR Congo": ["terrorism"], "At Least Six Mozambicans Beheaded, Italian Nun Shot Dead by Insurgents (ISIS)": ["politics", "religion", "terrorism"], "Two killed outside Slovak gay bar by 'radicalised teenager'": ["religion", "terrorism"], "Eleven soldiers dead, 50 civilians missing after Burkina Faso convoy attack": ["politics", "terrorism"], "10 Burkina Faso Soldiers Killed, 50 Wounded in Army Base Attack": ["politics", "terrorism"], "Assessing the MSA-Islamic State’s Annual Dry Season Conflict": ["politics", "religion", "terrorism"], "Twin blasts in Jerusalem kill one in suspected Palestinian attack": ["politics", "terrorism"], "USA: Coeur d' Alene Idaho: Sheriffs Have Released The Names Of 31 Patriot Front Members Who Were Arrested At A LGBTQ+ Pride Event In Idaho": ["politics"], "Nine torture chambers and 432 bodies of murdered civilians found in Kherson Oblast": ["terrorism"], "UN experts say Rwanda provided military support to M23 rebels in eastern Congo": ["politics", "terrorism"], "‘It Was Horror’: Ukrainians Share Grim Tales of Russian Occupation": ["politics", "psychology", "terrorism"], "Ambush claimed by Pakistani Taliban kills three police officers in northern Pakistan": ["politics", "religion", "terrorism"], "Former CIA Operative Enrique 'Ric' Prado Writing Memoir": ["politics"], "Tunisia arrests Boko Haram alleged affiliates": ["politics", "religion", "terrorism"], "Taliban Militants Claim Responsibility for Rare Attack in Pakistan’s Capital": ["politics", "religion", "terrorism"], "European Parliament declares Russia a state sponsor of terrorism": ["politics", "terrorism"], "Nigeria Jihadists Kidnap 20 Children in Borno State, Residents Say": ["politics", "religion", "terrorism"], "Trial begins for three men accused of plotting to kidnap Michigan governor": ["politics", "terrorism"], "Opinion | How the Sinaloa Cartel rules": ["politics", "terrorism"], "Iranian drone components show evidence of country evading sanctions": ["politics"], "A Community for OSINT Collaboration and Networking!": ["neutral"], "Russian horrific castration of Ukrainian POW was about terror and preventing own soldiers from surrendering": ["politics", "psychology", "terrorism"], "The story of little Liza, killed in her stroller by a Russian missile": ["politics", "terrorism"], "Two Pakistani Police Killed In Blast In Former Militant Stronghold": ["politics", "terrorism"], "One Hurt as Package Explodes at University in Boston -Police": ["terrorism"], "Man Sentenced to 20 Years in Prison for Attempting to Provide Material Support to ISIS": ["politics", "religion", "terrorism"], "Uygur separatist group rebuilds bases in Afghanistan even as China-Taliban ties grow": ["politics", "religion", "terrorism"], "U.S. believes 'huge' total of 75,000 Russian soldiers have been killed or injured in Ukraine": ["politics", "terrorism"], "Somalia Asks U.S. to Step Up Drone Strikes Against Qaeda-Linked Fighters: A new administration in Somalia has launched an offensive against Al Shabab, which are also facing an uprising from local militias.": ["politics", "religion", "terrorism"], "Do we have any evidence of how ISIS treats members who make important mistakes? For example an error in executing an operation.": ["religion", "terrorism"], "Al-Qaeda affiliate claims attack on Mali’s main military base near Bamako": ["politics", "religion", "terrorism"], "Suicide Bomb Blast in Somali Capital Kills Several People": ["terrorism"], "USA: Domestic Terrorism: Jan. 6th Witness, Trump Campaign Manager Bill Stepien, Testifies That Donald Trump Was 'Detached From Reality' About His Victory In The 2020 Presidential Election, Actually Won By Joe Biden, On Day 2 Of The US House Investigative Committee Hearings": ["politics"], "Militants Kill 6 in Attack on Convoy From Burkina Faso Gold Mine": ["politics", "terrorism"], "Kenyan Authorities Suspect Al-Shabab Militants Kill 6 in Coastal County": ["politics", "religion", "terrorism"], "5 Dead, 18 Hurt in Shooting at Gay Nightclub in Colorado, Police Say": ["terrorism"], "MoA - Syria - Another Turkish Invasion Is Imminent": ["politics", "terrorism"], "Six dead in Istanbul blast, Erdogan says it 'smells like terrorism'": ["politics", "terrorism"], "Top Iran footballer arrested at club for ‘spreading propaganda against the state’ | Iran": ["politics", "terrorism"], "U.S. Treasury Designates Additional Targets in Hezbollah Financial Network": ["politics", "religion", "terrorism"], "Al-Qaeda Network in Brazil Designated as Global Terrorists": ["politics", "religion", "terrorism"], "Fear and Loathing in Moscow: The Russian biological weapons program in 2022": ["politics", "psychology", "terrorism"], "Palestinian gunmen shoot at Israeli worshipers at Joseph's Tomb": ["politics", "religion", "terrorism"], "Nord Stream Blasts Were Likely Result of Sabotage, German Probe Finds": ["politics", "terrorism"], "Somalia president: at least 100 people killed in car bombs": ["politics", "terrorism"], "Who Dropped Thousands Of Antipersonnel ‘Butterfly’ Mines On Donetsk?": ["politics", "terrorism"], "Nigerian Officials Say Terror Group ISWAP Behind Church Massacre": ["politics", "religion", "terrorism"], "Police: Woman who opened fire at Dallas airport shot at cop": ["politics", "terrorism"], "Factbox-Who Are Islamic State's Affiliates in Central Africa?": ["politics", "religion", "terrorism"], "Al-Zawahiri killed at home of Taliban lackey New York Times gave platform to": ["politics", "religion", "terrorism"], "S.Africa parliament fire suspect charged with terrorism": ["politics", "terrorism"], "Genelle Guzman-McMillan—the last survivor pulled from the 9/11 wreckage of the fall of the #TwinTowers .": ["politics", "terrorism"], "“Huge flaw” threatens US emergency alert system, DHS researcher warns": ["politics"], "The Importance of Terrorist Founders and the Role of Safe Havens": ["terrorism"], "Ukraine on edge after Zaporizhzhia nuclear plant shelled": ["politics", "terrorism"], "Somalia: Al-Shabaab militants entered Mogadishu's Hyatt Hotel; 8 killed, many injured": ["religion", "terrorism"], "Prayers and release of birds to mark 20 years since Bali bombing": ["politics", "terrorism"], "Blasts Kill 5 in Nigeria’s Maiduguri as President Visits": ["politics", "terrorism"], "Indonesian Pro-Islamic State Community’s Stances on COVID-19 Vaccination: Security Implications": ["neutral"], "11 years ago this was the tweet that outed the raid on Osama Bin Laden": ["politics", "religion", "terrorism"], "DHS blocked vital research on domestic threats, say terrorism experts": ["politics", "terrorism"], "Four people killed, 10 hurt in suicide blast in Somali capital": ["terrorism"], "Feds: Kansas woman led all-female Islamic State battalion": ["politics", "religion"], "Fiber-optic Submarine Cable near Faroe and Shetland Islands Damaged; Mediterranean Cables also Cut": ["neutral"], "2 decades later, 9/11 self-professed mastermind awaits trial": ["terrorism"], "3 soldiers killed in Abu Sayyaf ambush in Basilan": ["politics", "religion", "terrorism"], "Very insteresting book about historic political terrorism and list of groups in many countries of the world [Political Terrorism by A.J. Jongman]": ["politics", "terrorism"], "ISKP’s Uzbekistan-directed attack bolsters rhetoric with deeds": ["politics", "religion", "terrorism"], "Blast kills more than 50 at Kabul mosque, its leader says": ["religion", "terrorism"], "Mogadishu Police Chief Killed in Blast": ["politics", "terrorism"], "Armed Man Who Stormed FBI Office Said He Wanted ‘War’ After Mar-a-Lago Raid": ["politics", "terrorism"], "Here is our initial reaction to the Manila RTC decision yesterday dismissing the terrorist proscription case filed by Philippine government against the CPP/NPA. -Marco L. Valbuena, (Chief Information Officer) Communist Party of the Philippines": ["politics", "terrorism"], "Doomsday New York: If Big Apple is hit with a nuke, here’s what happens": ["terrorism"], "Somali Islamist Insurgents Make Gains as Government and Allies Fall Out": ["politics", "religion", "terrorism"], "Stochastic White Nationalist Domestic Terrorism: Patriot Front Founder, Thomas Ryan Rousseau, Among Those Arrested Near Idaho Pride LBGTQ Celebration": ["politics", "terrorism"], "Shin Bet thwarts bus bombing by Gazan with work permit": ["politics", "terrorism"], "20 Years After 9/11: Can Indonesia Win The War Against Terrorism? | Insight | Full Episode": ["politics", "terrorism"], "Gaza Militant Group Raises Funds via Cryptocurrency for Jihad Against Israel": ["politics", "religion", "terrorism"], "\"How Al-Qaeda in Indian Subcontinent Exploits the Prophet Controversy in India\"": ["politics", "religion", "terrorism"], "Update: Eleven soldiers dead, 50 civilians missing after Burkina Faso convoy attack": ["politics", "terrorism"], "German army officer sentenced to jail for attack plan": ["politics", "terrorism"], "Australia’s Listing of Hezbollah Ends a Fiction and is a Blow to Iranian Grand Ambitions": ["politics", "religion", "terrorism"], "Lithuania pays compensation to al Qaeda suspect at CIA jail it hosted": ["politics", "religion", "terrorism"], "Mali: militants fire on bus, killing at least 31 people - Insurgents shoot villagers going to a market on the same day UN peacekeeping convoy attacked, killing one person": ["politics", "terrorism"], "AQ future": ["neutral"], "Secret People: Ted Kaczynski": ["terrorism"], "Somalia's al Shabaab fighters kill at least 7 in attack near capital": ["politics", "religion", "terrorism"], "Pakistan Says Attacks On Bases Repulsed; Up To 12 Soldiers, 15 Attackers Killed": ["politics", "terrorism"], "Al Qaeda affiliate claims attack on Mali's main military base": ["politics", "religion", "terrorism"], "A school shooting shattered a town in 1997. Now the gunman could get parole.": ["terrorism"], "Danish woman evacuated from Syrian camps sentenced for aiding Islamic State": ["politics", "religion", "terrorism"], "Italy Arrests Pakistanis Linked to 2020 Charlie Hebdo Attack": ["politics", "religion", "terrorism"], "U.N. Says China May Have Committed ‘Crimes Against Humanity’ in Xinjiang": ["politics", "terrorism"], "Who Really Chooses to Become a Suicide Bomber? - Modern War Institute": ["terrorism"], "‘434 terror attacks’ reported against Pakistani security forces during six months of 2022": ["politics", "terrorism"], "The Impact of Ayman al-Zawahiri’s Death on Terrorism and Counter-Terrorism in India": ["politics", "terrorism"], "North Korea-backed hackers have a clever way to read your Gmail": ["politics"], "Wagner's Prigozhin gave bloody sledgehammer to EU for terror designation": ["politics", "religion", "terrorism"], "SOHR: Israeli strike destroyed over 1,000 Iran-made missiles in Syria": ["politics", "terrorism"], "Pakistani Police Officer, Two Gunmen Killed In Islamabad Shoot-Out": ["terrorism"], "Ukraine Invasion Day 176: a state sponsor of special military operations gets terrorized": ["politics", "psychology", "terrorism"], "How an American Survived Hiding From the Russians in Kherson for 8 Months": ["politics", "terrorism"], "Russia framing terrorist attacks on Chechens": ["politics", "terrorism"], "The Taliban’s Neighbors Fear Afghanistan’s ‘Boiling Pot’ of Terrorism": ["politics", "religion", "terrorism"], "Generation Killed: The Challenges of Routinizing Global Jihad": ["politics", "religion", "terrorism"], "Remembering September 11: Patriot Day": ["politics", "terrorism"], "Rushdie stabbed": ["politics", "terrorism"], "Israel": ["neutral"], "Suspected Islamists Kill at Least 12 in Eastern Congo Attacks on Villages": ["religion", "terrorism"], "At Least 15 Killed in Russian School Shooting": ["terrorism"], "Pentagon, Kurdish Peshmerga Continue Partnership To Fight ISIS": ["politics", "religion", "terrorism"], "Bomb attacks hit southern Thailand; two killed in police raid": ["politics", "terrorism"], "First photos of Turkey's Istiklal Avenue bomber during arrest": ["terrorism"], "For Daughter of American Militant, Scars of ISIS’ Reign Run Deep": ["psychology", "religion", "terrorism"], "ISIS-Yemen Province claims yesterday’s suicide bombing targeting a Houthi convoy in Baydah Governorate.": ["politics", "religion", "terrorism"], "Ukrainians Brace for the Worst Around Zaporizhzhia": ["politics", "terrorism"], "Putin’s Private Army Accused of Committing Their Most Heinous Massacre Yet": ["politics", "terrorism"], "Islamic State Names New Leader, Shares Only His Nom-de-Guerre": ["politics", "religion", "terrorism"], "Sweden Charges Woman for Enlisting Son, 12, to Fight in Syria": ["politics", "terrorism"], "Suicide Bombing in Somalia Kills One Soldier and Injures Six": ["terrorism"], "Western Diplomats Warn of Impending Disaster in Sahel": ["politics", "terrorism"], "Suspected Terrorist Attack in Israel Leaves Four Dead: In one of deadliest assaults against Israelis in recent years, an Arab Bedouin stabbed several people and rammed his car into a cyclist": ["politics", "terrorism"], "Disorganized Political Violence: A Demonstration Case of Temperature and Insurgency. The more discretion combatants have over the initiation of violence, the more violence is increased by high ambient temperatures.": ["politics", "terrorism"], "Attack on Mali Camp for People Fleeing Violence Kills 11": ["politics", "terrorism"], "German police foil anti-vaxxer murder plot against state premier": ["politics", "terrorism"], "Taliban executed more than 100 police, military officers after takeover": ["politics", "religion", "terrorism"], "IRA released a statement of their attack in Northern Ireland on August 15.": ["politics", "terrorism"], "Colombia's Leftist ELN Rebels Claim Responsibility for Bombing": ["politics", "terrorism"], "US Says IS Leader Killed Himself in Act of Cowardice": ["politics", "religion", "terrorism"], "Syria: Military Bus Blast Kills 18 Soldiers": ["politics", "terrorism"], "Civilians Flee as Jihadis Advance in Northeast Mali": ["politics", "religion", "terrorism"], "Global Jihad: A Brief History": ["politics", "religion", "terrorism"], "US Puts Sanctions on 14 Men for Alleged Ties to al-Shabab Financial, Arms Networks": ["politics", "religion", "terrorism"], "Why do mass casualty attackers Livestream their own mass casualty attacks?": ["politics", "terrorism"], "Paris Attacks Trial Resumes With Main Suspect Back in Court": ["politics", "terrorism"], "4 Burkina Troops, 3 Civilians Killed in Jihadist-hit North": ["politics", "religion", "terrorism"], "Why is ISIS recruiting beyond countries in physical contact with ISIS?": ["politics", "religion", "terrorism"], "UN to investigate prison attack that killed dozens of Ukrainian prisoners of war | Ukraine": ["politics", "terrorism"], "Al-Shabab Kills 21 in Somalia’s Hiran Province": ["politics", "religion", "terrorism"], "Nighttime U.S. Helicopter Raid Captures 'Senior Daesh Leader' In Syria": ["politics", "religion", "terrorism"], "firefight": ["neutral"]}